[   {
  "id": "rssummersummit2018",
  "name": "The Rolling Scopes Summer Summit",
  "date": "August 16-18",
  "location": "imaguru.co",
  "locationLink": "https://goo.gl/maps/d25d5sAxwBU2",
  "registerLink": "",
  "schedule": [

  ]
},
  {
  "id": "rs#49",
  "name": "The Rolling Scopes #49. Krakow",
  "date": "June 6, 2018",
  "location": "BARKA, Podgórska 16, Krakow",
  "locationLink": "https://goo.gl/maps/z4kXc5tHnZu",
  "registerLink": "https://www.eventbrite.com/e/rescheduled-the-rolling-scopes-49-krakow-tickets-45723140143",
  "schedule": [
    {
      "title": "VUI with Alexa & Node.js",
      "time": "19:00",
      "speakerIDs": [
        86
      ],
      "description": "Explore the world of Voice User Interfaces using Javascript and learn how to create your own.",
      "break": {
        "time": "19:40"
      }
    },
    {
      "title": "Generics and Mapped Types in TypeScript",
      "speakerIDs": [
        124
      ],
      "description": "Learn cases for generics and mapped types, understand better how to read those and TypeScript keywords in general.",
      "time": "20:00",
      "party": {
        "time": "20:40",
        "title": "Beer.js",
        "description": ""
      }
    }
  ]
},
  {
  "id": "rs#48",
  "name": "The Rolling Scopes #48. Gdansk",
  "date": "May 25, 2018",
  "location": "Gdansk, Olivia Six, EPAM Systems, 7th floor",
  "locationLink": "https://goo.gl/maps/WhKyQZMSFTy",
  "registerLink": "https://www.eventbrite.com/e/the-rolling-scopes-48-gdansk-tickets-44094249086",
  "schedule": [
    {
      "title": "Registration",
      "speakerIDs": [
        95
      ],
      "description": "<p>Pizza & Beverages & Networking</p> ",
      "time": "17:00"
    },
    {
      "title": "“Backend For Frontend“ with NestJS: usage patterns",
      "time": "17:10",
      "break": {
        "time": "17:50"
      },
      "speakerCity": "Gdańsk, Poland",
      "speakerIDs": [
        118
      ],
      "description": "<p>In recent years, thanks to Node.js, JavaScript has become the “lingua franca“ of the web for both front and backend applications, giving rise to awesome projects like Angular, React and Vue which improve developer productivity and enable the construction of fast, testable, extensible frontend applications. However, on the server-side, while there are a lot of superb libraries, helpers and tools for Node, none of them effectively solve the main problem - the architecture.</p><p>Nest aims to provide an application architecture out of the box which allows for effortless creation of highly testable, scalable, loosely coupled and easily maintainable applications.</p> <p>About speaker: <span class='italic'>“Hi my name is Slava, I'm a software architect and developer from Belarus living in Poland. I started working with EPAM back in 2000. My professional focus is Java/JavaScript technologies. I love coding and setting up new projects. In spare time I enjoy reading, travelling and spending time with my family.” </span></p>"
    },
    {
      "title": "JS Jungle Quiz",
      "time": "18:00",
      "speakerIDs": [
        125
      ],
      "description": "<p>We joyfully invite you to share a celebration of <a target='_blank' href='https://github.com/js-day/js-day'>JavaScript Developer Day</a> in Gdansk.</p><p>Unfortunately, we will not have time to organize a carnival :) So we invite you to take part in our JS Quiz like additional fun besides yellow/orange dressing, drinking mocha and eating bananas.</p><p>The quiz will comprise of six/seven rounds on general knowledge of programming, javascript and front-end topics. You will be able to team up with another meetup participants before quiz beginning.</p> <p>Also, we are looking for your tricky JS/web-related questions so this quiz will be really hot. If you have one, please use the following form to upload: <a href='https://docs.google.com/forms/d/e/1FAIpQLScrKoh78aOHUnrPoMgTYeSXWxchezLTVVpMxiTytB18ocIQBw/viewform'>Form link</a></p>"
    }
  ]
},
  {
    "id": "rs#47",
    "name": "The Rolling Scopes #47",
    "date": "24 апреля 2018",
    "location": "imaguru.co",
    "locationLink": "https://goo.gl/maps/d25d5sAxwBU2",
    "registerLink": "https://www.eventbrite.com/e/the-rolling-scopes-47-minsk-tickets-44975657402",
    "schedule": [
      {
        "title": "GraphQL essentials: what you should know",
        "speakerIDs": [
          122
        ],
        "description": "This talks will introduce you to the purpose of GraphQL and ecosystem around it, the basics of its syntax (requests and responses shapes, fragments, attributes and variables) and main open source tools you can use to create your first GraphQL server and to send requests from a client. Get ready for the journey! :)",
        "time": "19:30",
        "break": {
        "time": "20:10"
      }
      },
      {
        "title": "oAuth2 под микроскопом",
        "speakerIDs": [
          123
        ],
        "description": "Я расскажу о системах авторизации и как они выглядят с серверной и клиентской стороны, подробно остановлюсь на спецификациях oAuth. Вместе мы попробуем развенчать миф о том, что протокол сложный для освоения.",
        "time": "20:30"
      }
    ]
  },
  {
  "id": "rs#46",
  "name": "The Rolling Scopes #46. Mogilev",
  "date": "April 21, 2018",
  "location": "Тайм-кафе НЕБО, г. Могилев",
  "locationLink": "https://goo.gl/maps/6DQME4Xrbjp",
  "registerLink": "https://www.eventbrite.com/e/the-rolling-scopes-45-mogilev-tickets-41817579506",
  "schedule": [
    {
      "title": "Registration",
      "time": "14:45",
      "imagePath": "images/logo_rs2.svg",
      "speakerIDs": [
        95
      ],
      "description": "Coffee & Networking"
    },
    {
      "title": "Introduction of The Rolling Scopes",
      "time": "15:00",
      "imagePath": "images/logo_rs2.svg",
      "speakerIDs": [
        120, 57
      ],
      "description": ""
    },
    {
      "title": "Monads - coding functionally",
      "time": "15:15",
      "speakerIDs": [
        114
      ],
      "description": "Beyond the general approaches to coding as well as OOP designs, there is a pretty new functional wave to have your programs written in a neat and elegant way, especially when it comes to JavaScript. An extremely flexible architecture of the language allows us to take the full advantage of the functional programming and opens the gates to the constructions that this approach brings with it. We will consider some implementations of functional constructions, monads, functors, etc. and how they can be utilized in todays applications."
    },
    {
      "title": "Нормально делай — нормально будет",
      "time": "15:55",
      "speakerIDs": [
        119
      ],
      "description": "Про Тайпскрипт, тулинг, код ревью, стандарты форматирования, рефакторинг, репозитории, память и процессор. И почему «нормально» — уже хорошо."
    },
    {
      "title": "Growing as a developer",
      "time": "16:40",
      "speakerIDs": [
        57
      ],
      "description": "Каждый разработчик всегда думает на два шага вперед, поэтому рассмотрим основные методы развития специалиста"
    },
    {
      "title": "Coffee Break & JS Marathon",
      "time": "17:20",
      "imagePath": "images/logo_rs2.svg",
      "speakerIDs": [
        121, 120
      ],
      "description": "Докажите, что вы лучше всех знаете Javascript в развлекательном приложении JS Marathon. За 7 минут вам надо решить как можно больше задач или как можно сложнее задачи, чтобы набрать наибольшее количество баллов и обогнать конкурентов. Будьте лучшим из лучшим! За первые 3 места на марафоне будут призы. <p><b>ВНИМАНИЕ:</b> Для участия необходим ноутбук.</p>"
    },
    {
      "title": "Node.JS World",
      "time": "17:40",
      "speakerIDs": [
        115
      ],
      "description": "NodeJs - это целая вселенная со своими пакетными менеджерами и редакторами кода, написанными на ней же. Я хочу погрузить вас в этот мир и показать, как этим можно пользоваться."
    },
    {
      "title": "CSS Grid layout - practice tricks",
      "time": "18:20",
      "speakerIDs": [
        117
      ],
      "description": "Все еще не работал с сеткой CSS? Думаете, что это сложно? Я покажу вам, почему сетка CSS является лучшим инструментом создания макета и построения сложных систем сеток. Мы сравним её с другими методами построения лэйаута, такими как float, inline-block и flexbox."
    }
  ]
},
  {
  "id": "rs#45",
  "name": "The Rolling Scopes #45",
  "date": "March 14, 2018",
  "location": "Olivia Business Centre - Olivia Four, Gdansk",
  "locationLink": "https://gdansk.rollingscopes.com#venue",
  "registerLink": "https://www.eventbrite.com/e/the-rolling-scopes-45-gdansk-tickets-42709114110",
  "schedule": [
    {
      "title": "Registration",
      "speakerIDs": [
        95
      ],
      "description": "<p>Pizza & Beverages & Networking</p> ",
      "time": "17:40"
    },
    {
      "title": "How to upgrade your visual skills as a Front-End developer",
      "speakerCity": "Warsaw, Poland",
      "speakerIDs": [
        112
      ],
      "description": "<p>Many clients complain that devs don't feel visual aspects - typography, alignments and basically visual hierarchy. I want to talk about fundamental rules, good practices, which can be useful for every developer and I want to present good ways to cooperate between designer & devs.</p><p class='italic'>About speaker: \"I’m the member of Toptal community & UX/UI designer @ Risen - Software House from Poland, creating web/mobile solutions for European & American clients. Academically I’m spending time on behavioral economics & psychology @ Warsaw School of Economics. Formerly I liked to run, even marathon.\"</p>",
      "time": "18:00"
    },
    {
      "title": "One year without REST",
      "speakerCity": "São Paulo - Brasil",
      "speakerIDs": [
        113
      ],
      "description": "<p>Since my first days as developer, I was addicted to REST APIs over any other things, but now I’m free of this vicious, my last REST service was written more than one year ago and I’m here to tell you how was my path discovering the bad, the good and the awesome GraphQL in this amazing year.</p> <p class='italic'>About speaker: \"Hi my name is Marcos, I’m a software engineer from Brazil living in Poland. Back in Brazil I was one organizer of NodeBR (node.js user group in Brazil) and the first NodeConf BR(first NodeConf in Latin America lands), beside that I write some articles in my blog about Node.js and in free time I just work for an amazing company. \"</p>",
      "time": "18:45",
      "shortbreak": {
        "time": "19:30"
      }
    },
    {
      "title": "Our way to 12-factor apps",
      "speakerCity": "Gdansk, Poland",
      "speakerIDs": [
        89
      ],
      "description": "<p>The twelve-factor app is a methodology for building software-as-a-service apps that:</p><ul><li>Use declarative formats for setup automation, to minimize time and cost for new developers joining the project</li><li>Have a clean contract with the underlying operating system, offering maximum portability between execution environments</li><li>Are suitable for deployment on modern cloud platforms, obviating the need for servers and systems administration</li><li>Minimize divergence between development and production, enabling continuous deployment for maximum agility</li><li>And can scale up without significant changes to tooling, architecture, or development practices</li></ul><p>The twelve-factor methodology can be applied to apps written in any programming language, and which use any combination of backing services (database, queue, memory cache, etc) <a target='_blank' href='https://12factor.net/'>https://12factor.net/</a></p>",
      "time": "19:40"
    }
  ]
},
  {
  "id": "rs#44",
  "name": "The Rolling Scopes #44",
  "date": "January 31, 2018",
  "location": "Olivia Business Centre - Olivia Four, Gdansk",
  "locationLink": "https://gdansk.rollingscopes.com#venue",
  "registerLink": "https://www.eventbrite.com/e/the-rolling-scopes-44-gdansk-tickets-41204963154",
  "schedule": [
    {
      "title": "Registration",
      "speakerIDs": [
        95
      ],
      "description": "<p>Pizza & Beverages & Networking</p> ",
      "time": "17:40"
    },
    {
      "title": "(R)Evolution of set-top boxes",
      "speakerCity": "Amsterdam, The Netherlands",
      "speakerIDs": [
        29
      ],
      "description": "<p>JavaScript is no longer about animating DIVs and sending forms. On the example of UI development for set-top boxes (like UPC Horizon, Orange TV decoder), I’ll tell a story about our evolution of JS usage on devices not suitable at all for it (or?).</p> <p class='italic'>Kirill Knysh, Engineer at EPAM Systems Amsterdam, 4+ years of experience of STB UI development, passionate to coding.</p> ",
      "time": "18:00"
    },
    {
      "title": "Tricky JS and WebGL practices to achieve the best performance on mobile",
      "speakerCity": "Minsk, Belarus",
      "speakerIDs": [
        46
      ],
      "description": "<p>Tricky JS and WebGL practices to achieve the best performance on mobile. We'll speak about set of interesting practices our team applied on our project to achieve lower network payload with help of run-length encoding, reduce time to first paint and memory pressure to minimum using lazy iterators, being 60FPS even on android after implementing own light-weight WebGL library instead of using Pixi.js</p> <p class='italic'>Andrei Vouchanka, the Software developer at EPAM Systems. Passioned about front-end development, bleeding edge web-technologies, js performance, public speaking and knowledge sharing. Constantly experimenting with new stuff, messing around with pet projects for fun</p>",
      "time": "18:45",
      "shortbreak": {
        "time": "19:30"
      }
    },
    {
      "title": "Who is the client",
      "speakerCity": "Gdansk, Poland",
      "speakerIDs": [
        111
      ],
      "description": " <p>It will be about how the browser´s Render Engine works and how this knowledge can improve the performance on front-end.</p><p>Some points to be discussed:</p><ul><li>Is the DOM really slow?</li><li>The Virtual DOM and is it the solution for performance on DOM updates?</li><li>The new Performance tab of chrome and how we can use it to measure front-end performance.</li></ul><p class='italic'>Marcelo Gomes works with front-end development since 2009. He likes playing chess, playing drums and making questions. He is from Brazil but currently lives in Gdansk.</p>",
      "time": "19:40"
    },
    {
      "title": "Mogensen-Scott encoding",
      "speakerCity": "Berlin, Germany",
      "speakerIDs": [
        0
      ],
      "description": "<p class='italic'>Alex is employed as a front-end engineer at Wix.com, earning just enough to sustain his functional programming addiction. In his spare time, he teaches programming and creates educational games with his hacker friends.</p>",
      "time": "20:00"
    },
    {
      "title": "CSS QuickDraw",
      "speakerIDs": [
        0
      ],
      "imagePath": "images/speakers/cowboy.jpg",
      "description": "<p>Your CSS is fast, but are you? Can you survive in the Wild West of front-end? Test your reflexes and stylesheet skills in a multiplayer game. Compete against your friends and colleagues to prove you have true CSS grit!</p><p><i>Please bring your laptop!</i></p>",
      "time": "20:40"
    }
  ]
},
  {
    "id": "rs#43",
    "name": "The Rolling Scopes #43",
    "date": "18 октября 2017",
    "location": "imaguru.co",
    "locationLink": "https://goo.gl/maps/d25d5sAxwBU2",
    "registerLink": "https://www.eventbrite.com/e/the-rolling-scopes-43-minsk-tickets-38719322536",
    "schedule": [
      {
        "title": "Око Саурона в браузере",
        "speakerIDs": [
          110
        ],
        "description": "В докладе речь пойдёт о расширение для Chrome, которое следит, чтобы хоббиты не списывали во время экзаменов. Тотальный контроль. Неограниченные полномочия. Абсолютная власть.",
        "time": "19:00"
      },
      {
        "title": "Рекуперативный подход",
        "speakerIDs": [
          48
        ],
        "description": "Компенсационные транзакции и профилактика кодопреципитации",
        "time": "19:45",
        "break": {
          "time": "20:30"
        }
      },
      {
        "title": "WASM: будущее веба, чем является и чем не является",
        "speakerIDs": [
          102
        ],
        "description": "Что такое wasm и кому он нужен? Убьет ли он наш (не)любимый JS? Будем ли мы клепать формочки на rust? А это вообще безопасно? Причем здесь asm.js и emscripten? Все что вы хотели знать, но боялись спросить.",
        "time": "20:50"
      }
    ]
  },
  {
  "id": "rs#42",
  "name": "The Rolling Scopes #42",
  "date": "6 октября 2017",
  "location": "imaguru.co",
  "locationLink": "https://goo.gl/maps/d25d5sAxwBU2",
  "registerLink": "https://www.eventbrite.com/e/the-rolling-scopes-42-minsk-tickets-38431804562",
  "schedule": [
    {
      "title": "Митап о #microsoft #react #redux #berlin",
      "speakerIDs": [
        109
      ],
      "description": "Алексей работает старшим инженером в Microsoft Berlin и трудится над веб-версией Microsoft To-Do. В свободное время тренирует программистов, оттачивает мастерство и троллит в твиттере. Ведёт бложик <a href='http://mtdv.io'>http://mtdv.io</a>. Made in Belarus. Живёт в Берлине. Был замечен в организации OdessaJS. На митапе затронем две основные темы: <br><ul><li>Как Microsoft To-Do команда использует React &amp; Redux <br> Инженер команды Microsoft To-Do поделится опытом команды в использовании реакт и редакс «по-майкрософтовски». Послушаем, какие необычные проблемы возникают в, казалось бы, несложном приложениии и подходы к их решению.</li><li>Q&amp;A по Microsoft/Berlin <br> Алексей ответит на все Ваши вопросы по Microsoft и поделится его опытом релокации/проживания в Берлине.</li></ul>",
      "time": "19:00"
    }
  ]
},
  {
    "id": "rs#41",
    "name": "The Rolling Scopes #41",
    "date": "15 августа 2017",
    "location": "imaguru.co",
    "locationLink": "https://goo.gl/maps/d25d5sAxwBU2",
    "registerLink": "https://www.eventbrite.com/e/the-rolling-scopes-41-minsk-tickets-35994973936",
    "schedule": [
      {
      "title": "Hack the Dom         or Modern Chrome Extension in the Wild",
      "speakerIDs": [
        18
      ],
      "description": "The talk will consist from short overview of Web Extensions capabilities, the ways of hacking into the dom and applications of that methods in gmail extensions.",
      "time": "19:00",
      "break": {
        "time": "19:45"
      }
    },
      {
        "title": "Про статические типы в JS",
        "speakerIDs": [
          102
        ],
        "description": "Почему-то 5 лет назад появился &laquo;язык&raquo; typescript. 3 год назад почему-то появилась &laquo;надстройка&raquo; над ES от facebook - flowtype. Кратко о том, кто это такие, зачем они появились, что умеют сейчас сами, что умеет инфраструктура, благодаря им, и что планируют дальше. И с примерчиками.",
        "time": "19:50",
        "break": {
          "time": "20:35"
        }
      },
      {
        "title": "Persistent Memory and Linux",
        "time": "20:40",
        "speakerIDs": [
          90
        ],
        "description": "Рассказ Кирилла о процессе разработки ядра Linux на позапрошлом митапе слушатели оценили как «Жутко интересный» и потребовали больше хардкора. В новом докладе мы послушаем и обсудим Persistent Memory and Linux.Кирилл контрибьютит в Linux Kernel c 2005 года, а последние 6 лет занимает должность Senior Linux Kernel Developer в Intel Corporation."
      }
    ]
  },
  {
    "id": "rs#40",
    "name": "RS Summer Summit 2017. Minsk",
    "date": "20-23 июня, 2017",
    "location": "imaguru.co",
    "locationLink": "https://goo.gl/maps/d25d5sAxwBU2",
    "registerLink": "https://www.eventbrite.com/e/rs-summer-summit-2017-minsk-tickets-35400926123",
    "schedule": [
      {
        "title": "Про TDD, BDD и зачем все это",
        "speakerIDs": [
          102
        ],
        "description": "Кратко о том, что такое тест и чем он отличается от спеки; зачем писать тесты и зачем писать тесты до кода; какие у всего этого плюсы и когда это все не нужно; как исторически процесс-разработки стал включать циклы тестирования."
      },
      {
        "title": "React Native shared components. Write once, use everywhere (well, almost everywhere)",
        "speakerIDs": [
          46
        ],
        "description": "Поговорим об экспансии react.js во все сферы разработки, server-side rendering-е, next.js, как вклинить webgl компонент в реактовский жизненный цикл, слепить из всего этого «реюзабельную» библиотеку, написать вокруг нее UI на react native + react native web."
      },
      {
        "title": "React Native & ClosureScript",
        "speakerIDs": [
          41
        ],
        "description": "После анонса Сreate React Native App можно сказать, что входной барьер написания нативных приложений стал достаточно низок. Так давайте добавим выразительность, прагматизм и эффективность СlojureScript..."
      },
      {
        "title": "Service design for «Krumkachy» football team",
        "speakerIDs": [
          103
        ]
      },
      {
        "title": "Оценка интерфейсов",
        "speakerIDs": [
          56
        ],
        "description": "Типичные проблемы найденные на проектах в разных доменных областях: массовые продукты, финансовые инструменты, специализированные продукты (навигатор для кораблей) и тд. Советы, на что обращать внимание, если вы увлеклись «фичиризмом» и команда программистов реализует новые опции, «потому что может»."
      },
      {
        "title": "Education in Design или Как выучить дизайнеров?",
        "speakerIDs": [
          104
        ],
        "description": "Доклад предназначен для Design Team Leads, которые заинтересованы в развитии своих дизайнеров, настройке процесса обучения; и дизайнеров, которые хотят развиваться и расти в профессиональном плане. Наш департамент вырос с 20 до 55 дизайнеров в короткие сроки. Стала актуальной задача по определению уровня конкретного дизайнера: чем отличается Middle от Senior, как выровнять эти уровни между СНГ, Британией и США. Как обучить такое количество дизайнеров, выстроить Personal Development Plan. В докладе я расскажу, какие инструменты и методы мы разработали для этого, какие результаты это принесло."
      },
      {
        "title": "Accelerated Mobile Pages: Делаем WEB сверхбыстрым",
        "speakerIDs": [
          54
        ],
        "description": "Высокоуровневый обзор проекта AMP, open-source архитектуры от Google для мгновенной доставки контента"
      },
      {
        "title": "Product design audit & research",
        "speakerIDs": [
          105
        ]
      },
      {
        "title": "Никто ничего не читает (на самом деле это не так)",
        "speakerIDs": [
          66
        ],
        "description": "Анна расскажет о том, что пользователи читают тексты, так что история о «всё равно кто и что там напишет - уже не прокатывает»; о том, что в команде нужен человек, который умеет писать (как бы вы его не называли); в чём польза от такого человека команде и продукту"
      },
      {
        "title": "101 EPAM projects in one ecosystem",
        "speakerIDs": [
          106
        ],
        "description": "Наша история о том, как мы перешли от ограниченного проектами мышления к цельной экосистеме. Мы поделимся нашим опытом, подводными камнями, с которыми столкнулись на нашем пути и прогнозом на будущее."
      },
      {
        "title": "101 EPAM projects in one ecosystem",
        "speakerIDs": [
          107
        ],
        "description": "Наша история о том, как мы перешли от ограниченного проектами мышления к цельной экосистеме. Мы поделимся нашим опытом, подводными камнями, с которыми столкнулись на нашем пути и прогнозом на будущее."
      }
    ]
  },
  {
    "id": "rs#39",
    "name": "The Rolling Scopes #39. Grodno",
    "date": "June 10, 2017",
    "location": "ПВТ, ул. М. Горького, д.1, г. Гродно",
    "locationLink": "https://goo.gl/maps/27Zyis8WHNC2",
    "registerLink": "https://www.eventbrite.com/e/the-rolling-scopes-39-grodno-tickets-34271770789",
    "schedule": [
      {
        "title": "OpenGL rendering with Node and Rust",
        "imagePath": "images/speakers/andrei_vouchanka.jpg",
        "speakerIDs": [
          46
        ],
        "description": "Небольшой рассказ о том, как мы применили server side rendering не только для React части приложения, но и WebGL, как подружили серверную часть рендеринга с клиентской, с какими трудностями столкнулись.",
        "time": "15:00",
        "break": {
          "time": "15:40"
        }
      },
      {
        "title": "Serverless architecture: Functions as a Service",
        "speakerIDs": [
          19
        ],
        "description": "Рассмотрим новомодную парадигму для разработки и развертывания вашего кода, её особенности/недостатки и связь с JavaScript/NodeJS. Обсудим реализацию на базе Amazon Web Services.",
        "time": "15:50",
        "break": {
          "time": "16:50"
        }
      },
      {
        "title": "Accelerated Mobile Pages: Делаем WEB сверхбыстрым",
        "time": "17:00",
        "speakerIDs": [
          54
        ],
        "description": "Высокоуровневый обзор проекта AMP, open-source архитектуры от Google для мгновенной доставки контента",
        "break": {
          "time": "17:50"
        }
      },
      {
        "title": "React Native & ClosureScript",
        "time": "18:00",
        "speakerIDs": [
          41
        ],
        "description": "После анонса Сreate React Native App можно сказать, что входной барьер написания нативных приложений стал достаточно низок. Так давайте добавим выразительность, прагматизм и эффективность СlojureScript..."
      }
    ]
  },
  {
    "id": "rs#38",
    "name": "The Rolling Scopes #38. Minsk",
    "date": "16 мая, 2017",
    "location": "imaguru.co",
    "locationLink": "https://goo.gl/maps/d25d5sAxwBU2",
    "registerLink": "https://www.eventbrite.com/e/the-rolling-scopes-38-minsk-tickets-33906560435",
    "schedule": [
      {
        "title": "Панельная дискуссия: Образование в ИТ",
        "imagePath": "images/speakers/Panel_Discussion.jpg ",
        "time": "19:00",
        "speakerIDs": [
          18,
          19,
          32,
          43,
          46,
          96,
          97,
          98,
          99,
          100,
          101
        ],
        "description": "Обсудим образование в ИТ: <ul><li>курсы для новичков</li><li>онлайн и оффлайн курсы</li><li>самообразование</li><li>менторинг</li><li>процесс интервью</li></ul>"
      }
    ]
  },
  {
    "id": "rs#37",
    "name": "The Rolling Scopes #37. Gomel",
    "date": "17 июня, 2017",
    "location": "г. Гомель, ул. Ланге, д.17",
    "locationLink": "https://goo.gl/MC5Bjh",
    "registerLink": "https://www.eventbrite.com/e/the-rolling-scopes-37-gomel-tickets-33808126015",
    "schedule": [
      {
        "title": "Registration",
        "time": "14:45",
        "speakerIDs": [
          95
        ]
      },
      {
        "title": "Introduction to Elm (EN)",
        "time": "15:00",
        "speakerIDs": [
          93
        ],
        "description": "Elm is a functional language that compiles to JavaScript and ensures no runtime errors. It is a very promising language. It has a very strong emphasis on simplicity, ease-of-use, and quality tooling."
      },
      {
        "title": "Why client-side web technologies are wrong and what technologies are right (RU)",
        "time": "15:40",
        "speakerIDs": [
          92
        ],
        "description": "For historical reasons we use hypertext markup language for application creating - it looks like digging with a spoon instead of spade. My speech is about history and future of solving this problem."
      },
      {
        "title": "Application state management: flux, redux, mobx (RU)",
        "time": "16:20",
        "speakerIDs": [
          77
        ],
        "description": "A few words about state management in your application. When it becomes bigger you will probably want to control  the state more efficiently. Lets take a look at the state management tools for React applications and built-in capabilities in Angular2.",
        "break": {
          "time": "16:55"
        }
      },
      {
        "title": "Introduction to WebGL (RU)",
        "time": "17:10",
        "speakerIDs": [
          94
        ],
        "description": "The talk describes the basic concepts and algorithms for working with 3d graphics. Of course, you are more likely to use three.js than wasting time on low-level programming in WebGL, but understanding how it all works will help you get more from third-party libraries than you need and avoid time-consuming surprises."
      },
      {
        "title": "Reliable web apps with Elixir and Phoenix (RU)",
        "time": "17:50",
        "speakerIDs": [
          69
        ],
        "description": "I want to introduce brand new functional common purpose language called Elixir and his most interesting web framework - Phoenix. Elixir built on top of aged and well known platform created by Ericsson company - Erlang, but has more flexible and easy to read syntax inherited from such language as ruby. Pure functional language fit best for backend!"
      },
      {
        "title": "How to get into IT / Как войти в АйТи (RU)",
        "time": "18:35",
        "speakerIDs": [
          71
        ],
        "description": "Now almost everyone dreams of working in the IT and would like to be a software engineers. In the speech we will talk about the nearest events, which is conducted by Rolling Scopes community which can help to do first step for entering into IT."
      },
      {
        "title": "JS Marathon (RU)",
        "time": "18:45",
        "description": "Bring your laptops!",
        "speakerIDs": [
          95
        ]
      },
      {
        "title": "Awards ceremony (RU)",
        "time": "19:20",
        "speakerIDs": [
          95
        ],
        "party": {
          "time": "20:00",
          "title": "After Party",
          "description": "TBD"
        }
      }
    ]
  },
  {
    "id": "rs#35",
    "name": "The Rolling Scopes #35. Krakow",
    "date": "April 27, 2017",
    "location": "BARKA, Podgórska 16, Krakow",
    "locationLink": "https://goo.gl/maps/z4kXc5tHnZu",
    "registerLink": "",
    "schedule": [
      {
        "title": "Accessibility Driven Development: why would you even care?",
        "time": "18:30",
        "speakerIDs": [
          61
        ],
        "description": "When it comes to human rights, non-discrimination and anti-racism have you ever thought we're pretty much discriminating people in our day to day job? Pave the way to accessible web."
      },
      {
        "title": "Start Using Custom Elements",
        "time": "19:00",
        "speakerIDs": [
          86
        ],
        "description": "Quick introduction to start using Custom Elements now. The what, why and how.",
        "break": {
          "time": "19:30"
        }
      },
      {
        "title": "Lodash QuickDraw!",
        "time": "19:50",
        "speakerIDs": [
          0
        ],
        "description": "Dashing lodash shoot-out"
      },
      {
        "title": "Easy Mobile Apps with Ionic 2 Framework",
        "speakerIDs": [
          89
        ],
        "description": "Angular2-based apps with Native API for Android, iOS, Windows 10 using Cordova",
        "time": "20:35",
        "party": {
          "time": "21:10",
          "title": "Beer.js",
          "description": ""
        }
      }
    ]
  },
  {
    "id": "rs#34",
    "name": "The Rolling Scopes #34. Gdansk",
    "date": "April 26, 2017",
    "location": "Sztuka Wyboru, Słowackiego 19, Gdansk",
    "locationLink": "https://goo.gl/maps/nHZVYjcVum72",
    "registerLink": "",
    "schedule": [
      {
        "title": "Accessibility Driven Development: why would you even care?",
        "time": "18:30",
        "speakerIDs": [
          61
        ],
        "description": "When it comes to human rights, non-discrimination and anti-racism have you ever thought we're pretty much discriminating people in our day to day job? Pave the way to accessible web."
      },
      {
        "title": "Start Using Custom Elements",
        "time": "19:00",
        "speakerIDs": [
          86
        ],
        "description": "Quick introduction to start using Custom Elements now. The what, why and how.",
        "break": {
          "time": "19:30"
        }
      },
      {
        "title": "Lodash QuickDraw!",
        "time": "19:50",
        "speakerIDs": [
          0
        ],
        "description": "Dashing lodash shoot-out"
      },
      {
        "title": "Easy Mobile Apps with Ionic 2 Framework",
        "speakerIDs": [
          89
        ],
        "description": "Angular2-based apps with Native API for Android, iOS, Windows 10 using Cordova",
        "time": "20:35",
        "party": {
          "time": "21:10",
          "title": "Beer.js",
          "description": ""
        }
      }
    ]
  },
  {
    "id": "rs#36",
    "name": "The Rolling Scopes #36. Minsk",
    "date": "18 апреля, 2017",
    "location": "imaguru.co",
    "locationLink": "https://goo.gl/maps/d25d5sAxwBU2",
    "registerLink": "https://www.eventbrite.com/e/the-rolling-scopes-36-minsk-tickets-33577500207",
    "schedule": [
      {
        "title": "Как сделать чат бота за выходные",
        "imagePath": "images/speakers/igor_kolupaev.jpg",
        "time": "19:00",
        "speakerIDs": [
          91
        ],
        "description": "Как я прикрутил чат-бота к speedcamz.com за <s>40 минут</s> выходные на <s>js</s> <s>dotnet</s> golang. #AzureCognitiveServices #chatbot #telegram"
      },
      {
        "title": "OpenGL rendering with Node and Rust",
        "imagePath": "images/speakers/andrei_vouchanka.jpg",
        "speakerIDs": [
          46
        ],
        "description": "Небольшой рассказ о том, как мы применили server side rendering не только для React части приложения, но и WebGL, как подружили серверную часть рендеринга с клиентской, с какими трудностями столкнулись.",
        "time": "19:50",
        "break": {
          "time": "20:30"
        }
      },
      {
        "title": "Модель разработки ядра Linux",
        "imagePath": "images/speakers/kirill_shutemov1.jpg",
        "time": "20:50",
        "speakerIDs": [
          90
        ],
        "description": "В рубрике &laquo;А как у них&raquo; отвлечемся от front-end и послушаем/обсудим процесс разработки ядра Linux. <br/> Кирилл контрибьютит в Linux Kernel c 2005 года, а последние 6 лет занимает должность Senior Linux Kernel Developer в Intel Corporation."
      }
    ]
  },
  {
    "id": "rs#33",
    "name": "The Rolling Scopes #33. Brest",
    "date": "March 18, 2017",
    "location": "г. Брест, Машерова 6а, БЦ Цельсий, главный вход",
    "locationLink": "https://goo.gl/UGc1Rk",
    "registerLink": "https://goo.gl/forms/UZRD11wbN97S8hW53",
    "schedule": [
      {
        "title": "Декорируем Javascript",
        "time": "15:00",
        "speakerIDs": [
          54
        ],
        "description": "Черновики новой версии ECMAScript содержат новые интересные возможности - декораторы для классов, методов, свойств и аргументов. Рассмотрим, зачем они нужны и что интересного можно сделать с помощью декораторов."
      },
      {
        "title": "Compile it!",
        "time": "15:40",
        "speakerIDs": [
          55
        ],
        "description": "Делаем вычисления еще быстрее и эффективнее. Насколько позволяет разогнать вычисления браузер сегодня (WebGL, Web Workers, asm.js)? Что уже можно делать используя WebAssembly и что все же наступит в будущем.",
        "break": {
          "time": "16:20"
        }
      },
      {
        "title": "Введение в разработку Virtual Reality (VR) / ThreeJS",
        "time": "16:40",
        "speakerIDs": [
          87
        ],
        "description": "Введение в будущее, а именно в разработку приложений под VR устройства с использованием различных технологий. Рассмотрим, на каких платформах можно создавать решения для VR, и собственный опыт создания приложений сложнее вращения красного кубика. "
      },
      {
        "title": "RxJS и магия реактивного программирования",
        "speakerIDs": [
          88
        ],
        "description": "Как парадигма реактивного программирования может облегчить жизнь сферического фронтенд-разработчика в вакууме, а также какую роль в ней играет небезызвестный набор библиотек RxJS. Полезные заклинания в арсенал начинающего мага прилагаются.",
        "time": "17:20",
        "party": {
          "time": "18:30",
          "title": "Beer.js",
          "description": "Недавно открывшийся <a target='_blank' href='https://goo.gl/mKqI5s'>Бар Честная Пинта</a>"
        }
      }
    ]
  },
  {
    "id": "rs#32",
    "name": "The Rolling Scopes #32. Minsk",
    "date": "23 декабря, 2016",
    "location": "imaguru.co",
    "locationLink": "https://goo.gl/maps/d25d5sAxwBU2",
    "registerLink": "https://www.eventbrite.com/e/rs-32-panel-discussion-tickets-30293117530?aff=es2",
    "schedule": [
      {
        "title": "панельная дискуссия",
        "imagePath": "images/speakers/Panel_Discussion.jpg ",
        "time": "19:00",
        "speakerIDs": [
          7,
          31,
          27,
          18,
          57,
          22,
          19,
          30,
          6
        ],
        "description": "Обсудим технологии и техники, которыми Вы уже пользуетесь или планируете пользоваться в следующем году. Учитывая огромный список тем, вполне вероятно, что Вы найдете много новых идей для своих проектов. <p>Вот список тем, которые мы планируем обсудить в рамках дискуссии:</p><ul><li>Build process</li><li>CI & CD</li><li>Angular 1 и 2, React, Ember и тд.</li><li>TypeScript, Flow</li><li>ES 2016,2017+features, Babel</li><li>Redux</li><li>RxJS</li><li>Functional programming, purescript, elm</li><li>Offline & Client side DB - firebase, pouchDB, datascript</li><li>3D, WebGL, graphics, Unity, VR, Web VR, React VR & so on</li><li>Most usefull tools</li><li>Browsers & platforms evolution</li></ul>"
      }
    ]
  },
  {
    "id": "rs#31",
    "name": "The Rolling Scopes #31. Krakow",
    "date": "September 29, 2016",
    "location": "BARKA, Podgórska 16, Krakow",
    "locationLink": "https://goo.gl/maps/z4kXc5tHnZu",
    "schedule": [
      {
        "title": "Ethereum virtual machines in JS: cryptocurrency revolution",
        "speakerIDs": [
          62
        ],
        "description": "Ethereum is the open source, decentralized network. Well known Bitcoin is quite close to. But Ethereum is a different blockchain from Bitcoin and was created with the intention to allow self-executing smart contracts. Know why is it so important and how to rule the world with JS.",
        "time": "18:30"
      },
      {
        "title": "Modular JavaScript: put things on the right place",
        "speakerIDs": [
          6
        ],
        "description": "JS Module Formats, Module Loaders: RequireJS, Browserify, System.js, WebPack. How to find the way through all of those and don't get lost.",
        "time": "19:05",
        "break": {
          "time": "19:40"
        }
      },
      {
        "title": "Serverless architecture: Functions as a Service",
        "time": "20:00",
        "imagePath": "images/speakers/aws_lambda.png",
        "speakerIDs": [
          19,
          41
        ],
        "description": "What is Serverless and why is it worth considering? How this paradigm for developing and deploying is connected to JavaScript and Node.js? The benefits and drawbacks. Implementation Using Amazon Web Services."
      },
      {
        "title": "Designers at the lab",
        "speakerIDs": [
          81
        ],
        "description": "Designers in the Lab is the story of a team of designers from the Wix Studio, who embark on an adventure in the unknown territory of trend prediction. <br/> In this talk I’ll explain how designers view the world; why is it they get so emotional about pixels; what does it have to do with research methods and trend prediction; and how adapting work methods from different industries can help you inspire the future of our own.",
        "time": "20:30",
        "party": {
          "time": "21:00",
          "title": "Beer.js",
          "description": "Place: BARKA, Podgórska 16"
        }
      }
    ]
  },
  {
    "id": "rs#30",
    "name": "The Rolling Scopes #30. Gdansk",
    "date": "September 28, 2016",
    "location": "Business Center Olivia, Gdansk",
    "locationLink": "https://goo.gl/maps/raGpX9PdQJK2",
    "registerLink": "https://docs.google.com/forms/d/e/1FAIpQLSe15Cp-qkA0RrQuc52PGOntbz4DPs0fYofdxh616XOR0P1lyw/viewform",
    "schedule": [
      {
        "title": "Introduction of The Rolling Scopes",
        "time": "18:00",
        "imagePath": "images/logo_rs2.svg",
        "speakerIDs": [
          0,
          19,
          61
        ],
        "description": ""
      },
      {
        "title": "TypeScript and what's the hack Javascript",
        "time": "18:10",
        "speakerIDs": [
          61
        ],
        "description": "TypeScript is amazing/awful! What about ES6? How to use and when, what to choose? Introduction to the future of Javascript, how it fits with NodeJS. Compilation processes, must know things.",
        "break": {
          "time": "18:45"
        }
      },
      {
        "title": "Yes, you can use Web components in production",
        "time": "18:50",
        "speakerIDs": [
          85
        ],
        "description": "How to keep the application well structured and organized to start developing Web Components? How to implement quickly the 4 web components specifications: Custom elements, HTML Imports, Templates, Shadow DOM.<br/> Finally David will share how to use it in Production.",
        "break": {
          "time": "19:20"
        }
      },
      {
        "title": "Serverless architecture: Functions as a Service",
        "time": "19:25",
        "imagePath": "images/speakers/aws_lambda.png",
        "speakerIDs": [
          19,
          41
        ],
        "description": "What is Serverless and why is it worth considering? How this paradigm for developing and deploying is connected to JavaScript and Node.js? The benefits and drawbacks. Implementation Using Amazon Web Services.",
        "break": {
          "time": "19:55"
        }
      },
      {
        "title": "Designers at the lab",
        "speakerIDs": [
          81
        ],
        "description": "Designers in the Lab is the story of a team of designers from the Wix Studio, who embark on an adventure in the unknown territory of trend prediction. <br/> In this talk I’ll explain how designers view the world; why is it they get so emotional about pixels; what does it have to do with research methods and trend prediction; and how adapting work methods from different industries can help you inspire the future of our own.",
        "time": "20:00"
      },
      {
        "title": "CSS QuickDraw",
        "description": "Your CSS is fast, but are you? Can you survive in the Wild West of front-end? Test your reflexes and stylesheet skills in a multiplayer game. Compete against your friends and colleagues to prove you have true CSS grit! <br />(Please bring your laptop!)",
        "time": "20:35",
        "speakerIDs": [
          0
        ],
        "party": {
          "time": "21:00",
          "title": "Beer.js",
          "description": "TBD"
        }
      }
    ]
  },
  {
    "id": "rs#29",
    "name": "The Rolling Scopes #29. Minsk",
    "date": "20 сентября, 2016",
    "location": "imaguru.co",
    "locationLink": "https://goo.gl/maps/d25d5sAxwBU2",
    "registerLink": "https://docs.google.com/forms/d/e/1FAIpQLSc9DFvBZ1He4ocjNtWsWUkaag81SVc_P601Zvf4xJCFh57lxg/viewform",
    "schedule": [
      {
        "title": "New Opportunities for Augmented Reality",
        "imagePath": "images/speakers/unknown_speaker.jpg",
        "time": "19:00",
        "speakerIDs": [
          82,
          83
        ],
        "description": "Покажем и расскажем, как мы делали проект в Дополненной Реальности (AR). Рассмотрим, какие были подводные камни и как мы их обходили. Будет возможность посмотреть вживую на наш результат, которому customer сказал «Yes! Well done guys!»"
      },
      {
        "title": "Serverless architecture: Functions as a Service",
        "imagePath": "images/speakers/aws_lambda.png",
        "speakerIDs": [
          41,
          19
        ],
        "description": "Рассмотрим новомодную парадигму для разработки и развертывания вашего кода, её особенности/недостатки и связь с JavaScript/NodeJS. Обсудим реализацию на базе Amazon Web Services.",
        "time": "19:40",
        "break": {
          "time": "20:20"
        }
      },
      {
        "title": "QCon New York technology trends highlights",
        "imagePath": "images/speakers/vitali_shcharbin.jpg",
        "time": "20:30",
        "speakerIDs": [
          84
        ],
        "description": "Виталик посетил QCON в Нью-Йорке и готов сделать обзор самых интересных и полезных докладов конференции."
      }
    ]
  },
  {
    "id": "rs#28",
    "name": "The Rolling Scopes #28. Brest",
    "date": "6 августа, 2016",
    "location": "г. Брест, ул.Гоголя,13",
    "locationLink": "https://www.google.by/maps/place/Gogolia+St+13,+Brest/@52.090187,23.6789445,16.06z/data=!4m2!3m1!1s0x47210bec15bc9109:0x5e28b6234bb723b0?hl=en",
    "registerLink": "https://goo.gl/y6AvBb",
    "schedule": [
      {
        "title": "Immutable.js",
        "description": "ToDo",
        "time": "15:00",
        "speakerIDs": [
          52
        ]
      },
      {
        "title": "Популярные CSS фреймворки 2016. Нужно ли гнаться за модой?",
        "description": "Сравним несколько самых популярных css фреймворков, разберем подводные камни в работе с ними и определимся, обязательно ли использовать их везде.",
        "time": "15:40",
        "speakerIDs": [
          79
        ],
        "break": {
          "time": "16:10"
        }
      },
      {
        "title": "React.js hangover",
        "description": "Особенности боевых баталий на React.js. Чего ожидать и как готовится к новым версиям библиотеки. Немного о том, как переехать на новую версию реакта, если вы погрязли в мутабельных property. Не будут забыты и проблемы серверной стороны медали.",
        "time": "16:30",
        "speakerIDs": [
          55
        ],
        "break": {
          "time": "17:10"
        }
      },
      {
        "title": "Погружаемся в React native",
        "description": "JavaScript пытается проникнуть везде. Разработчикам популярного ReactJS стало мало только WEB, и они ринулись покорять мобильные платформы с React Native. Давайте же посмотрим, что может этот зверек для разработки нативных Android приложений.",
        "time": "17:20",
        "speakerIDs": [
          80
        ]
      },
      {
        "title": "Введение в теорию типов",
        "description": "Типизация в языках программирования. Пишем надёжный код без тестирования и отладки.",
        "time": "18:00",
        "speakerIDs": [
          78
        ],
        "party": {
          "time": "19:00",
          "title": "Beer.css party",
          "description": "Place: TBD"
        }
      }
    ]
  },
  {
    "id": "rs#27",
    "name": "The Rolling Scopes #27. Gomel",
    "date": "23 июля, 2016",
    "location": "CINEMA CLUB HOLLYWOOD, г. Гомель, ул. Коммунаров, 4",
    "locationLink": "https://goo.gl/maps/9KWpmSqSKww",
    "registerLink": "https://goo.gl/ts45t6",
    "schedule": [
      {
        "title": "Angular-Material in Practice",
        "description": "В докладе речь пойдет об опыте использования Angular-Material. Рассмотрим основные компоненты, директивы и сервисы. А также некоторые рецепты интеграции Angular-Material с готовым AngularJS приложением. Затронем также некоторые известные проблемы.",
        "time": "30 min",
        "speakerIDs": [
          69
        ]
      },
      {
        "title": "TypeScript: application-scale JavaScript.",
        "description": "С каждым годом JavaScript растет, но масштабируемость до сих пор остается одним из его слабых мест. Рассмотрим один из вариантов решения этой проблемы.",
        "time": "30 min",
        "speakerIDs": [
          70
        ]
      },
      {
        "title": "Как подружить JAVA сервер-сайд разработчика с JASMINE",
        "description": "В докладе пойдет речь о довольно интересном опыте применения BDD фреймворка Jasmine в команде JAVA сервер-сайд разработчиков. Рассмотрим, чем фронт-енд разработчик может быть полезен такой команде.",
        "time": "30 min",
        "speakerIDs": [
          71
        ]
      },
      {
        "title": "Как стать фронт-енд разработчиком с нуля",
        "description": "В этом докладе я собираюсь рассказать про особенности становления фронт-енд разработчика. Про ожидания работодателя и программиста. А также про любовь к профессии.",
        "time": "30 min",
        "speakerIDs": [
          72
        ]
      },
      {
        "title": "Некоторые алгоритмы и структуры для обработки строковых данных",
        "description": "Вероятно, от темы этого доклада так и веет университетским академизмом, но у нее, на самом деле, множество вариантов прикладного использования, которые находят применение в самых разнообразных областях, начиная от поиска и сравнения слов и заканчивая обработкой запросов на естественных языках и Data Mining'ом. В своем докладе я расскажу и покажу некоторые алгоритмы и структуры с примерами их использования, а так же рассмотрю библиотеку для работы с естественным языками -  natural.js.",
        "time": "30 min",
        "speakerIDs": [
          73
        ]
      },
      {
        "title": "Electron и JavaScript приложения для desktop.",
        "description": "В докладе пойдет речь об особенностях написания desktop приложений на JavaScript с использованием Electron: возможностях, недостатках и решении наиболее часто встречающихся задач.",
        "time": "30 min",
        "speakerIDs": [
          59
        ]
      },
      {
        "title": "Статическая типизация с Flow and Typescript",
        "description": "Как получить преимущество от статической типизации в React с помощью Flow и Typescript. Flow предназначен для статической проверки типов и предназначен для работы с React. Интеграция TypeScript более сложная и мы разберем проблемы такие как система интеграции классов(Class System Integration) и JSX.",
        "time": "30 min",
        "speakerIDs": [
          74
        ]
      },
      {
        "title": "Creating VR web",
        "speakerIDs": [
          57
        ],
        "description": "Взглянем на Virtual Reality с другой стороны - оценим перспективы развития, возможные сложности и, куда уж без них, подводные камни виртуальной реальности. Ну а затем шаг за шагом разберем процесс создания VR Web.",
        "time": "30m"
      },
      {
        "title": "Азбука HTML и CSS, или как научить толпу людей верстать",
        "speakerIDs": [
          76
        ],
        "description": "Хотелось бы рассказать, как мы делали для Rolling Scopes School курс верстки и что из этого вышло. Поговорим о программе, планировании, тасках, о том, чему  и как надо научить и при этом  не сойти с ума, проверяя по 50 одинаковых домашних работ. Поделюсь набитыми шишками и интересными идеями.",
        "time": "30m"
      },
      {
        "title": "CSS QuickDraw Gomel",
        "description": "Для тех, кто был участником RSConf, все знакомо: нужно с помощью CSS селекторов находить заданные элементы в тексте. При этом важны будут не только правильность, оптимальность, но и время выполнения запросов. Так что не забудьте взять свои ноутбуки. И пусть победит быстрейший ;)",
        "time": "30m",
        "imagePath": "images/speakers/cowboy.jpg",
        "speakerIDs": [
          71,
          77
        ]
      },
      {
        "title": "Самые распространеные лайфхаки фронтенд разработчика или как делать свою работу быстрее и проще",
        "description": "Рассмотрим самые известные и проверенные практики фронт-енд разработчиков, способные существенно облегчить и структурировать работу, известнейшие лайфхаки и трики, а также некоторые выводы, сделанные на  основании собственного опыта.",
        "time": "30 min",
        "speakerIDs": [
          75
        ],
        "party": {
          "time": "20:00",
          "title": "Beer.js party",
          "description": "CINEMA CLUB HOLLYWOOD (г. Гомель, ул. Коммунаров, 4)"
        }
      }
    ]
  },
  {
    "id": "rs#26",
    "name": "The Rolling Scopes #26. Krakow",
    "date": "June 16, 2016",
    "location": "Quattro Business Park, Krakow",
    "locationLink": "https://www.facebook.com/pages/Quattro-Business-Park-Krakow/221809917831667",
    "schedule": [
      {
        "title": "Introduction of The Rolling Scopes",
        "time": "17:00",
        "imagePath": "images/logo_rs2.svg",
        "speakerIDs": [
          0,
          19
        ],
        "description": ""
      },
      {
        "title": "TypeScript and what's the hack Javascript",
        "time": "17:10",
        "speakerIDs": [
          61
        ],
        "description": "TypeScript is amazing/awful! What about ES6? How to use and when, what to choose? Introduction to the future of Javascript, how it fits with NodeJS. Compilation processes, must know things.",
        "break": {
          "time": "17:45"
        }
      },
      {
        "title": "Virtual Augmented Mixed Reality: Day 0",
        "speakerIDs": [
          57
        ],
        "description": "Everybody knows that VAMR is amazing, but what does it actually stand for?<br />So we are going to take a look back into VAMR history and compare it with the current events, thus we might try to predict what is going to happen tomorrow.<br />Hold on! Why on Earth should I dive into this Wonderland in the first place? Let’s find the answer together.<br />",
        "time": "17:50",
        "break": {
          "time": "18:20"
        }
      },
      {
        "title": "3D visualization of datasets in browsers",
        "speakerIDs": [
          62
        ],
        "description": "The common case in every financial project (and not only) is \"how to present a big set of grid data in best way?\". Every developer already know about standard of 2D visualization in Highcharts, d3.js, etc. But what about 3D? WebGL brings new level of high-end quality of data presenting and managing.",
        "time": "18:40"
      },
      {
        "title": "CSS QuickDraw",
        "description": "Your CSS is fast, but are you? Can you survive in the Wild West of front-end? Test your reflexes and stylesheet skills in a multiplayer game. Compete against your friends and colleagues to prove you have true CSS grit! <br />(Please bring your laptop!)",
        "time": "19:15",
        "speakerIDs": [
          0
        ]
      }
    ]
  },
  {
    "id": "rs#25",
    "name": "The Rolling Scopes Summer Summit",
    "date": "3-4го июня, 2016",
    "location": "imaguru.co",
    "locationLink": "http://imaguru.co/ru",
    "schedule": [
      {
        "title": "Кто-то читает тексты в мобильной игре? Опыт World of Tanks Blitz и при чём здесь UX.",
        "speakerIDs": [
          66
        ],
        "description": "<ul><li>Текст в мобильной игре/приложении: какой и зачем?</li><li>Работа с текстом в WoT Blitz: как мы придумали процесс и принципы - и почему они нам нравятся;</li><li>Принципы работы с текстом в WoT Blitz: унификация,рефакторинг, локализации;</li><li>Ну и при чём здесь UX?</li><li>Полезные советы.</li></ul>",
        "time": "19:00 (3го июня)"
      },
      {
        "title": "Best UI Design Practices. UI Patterns",
        "speakerIDs": [
          63
        ],
        "description": "Как создать продукт, понятный пользователю? Как создать интерфейс, соответствующий ожиданиям пользователя? Не всегда есть возможность исследовать целевую аудиторию, поэтому мы поговорим о том, что мы можем сделать без UX-исследований, а точнее — о том, почему стоит придерживаться UI-паттернов и как правильно их выбирать.",
        "time": "19:25"
      },
      {
        "title": "Контекст! Контекст! Контекст!",
        "speakerIDs": [
          56
        ],
        "description": "Эта тема про все более и более актуальную часть дизайна, но, к сожалению, часто оставленную без должного внимания, про пользовательский контекст. Во времена, когда мы научились (почти) справляться с адаптивным дизайном, наша следующая задача как отрасли создание интеллектуальных продуктов, которые адаптируются под контекст использования. ",
        "time": "19:45",
        "break": {
          "time": "20:05"
        }
      },
      {
        "title": "\"Не иди за мной, я сам потерялся\" или что такое UX исследования, и зачем они нужны",
        "speakerIDs": [
          64
        ],
        "description": "Как человек научился измерять сам себя: социальные исследования. Основные методы UX-исследований. Почему мы заблуждаемся, когда думаем, что можем предугадать желания пользователей. И просто немного интересного о нас, о людях.",
        "time": "20:30"
      },
      {
        "title": "Постигаем CSS Grid Layout",
        "speakerIDs": [
          65
        ],
        "description": "Современный дизайн заставляет нас ломать голову над основной разметкой страницы. Благодаря спецификации CSS Grid Layout, скоро всё изменится!",
        "time": "20:50",
        "party": {
          "time": "21:30",
          "title": "Beer.css party",
          "description": "Place: TBD"
        }
      },
      {
        "title": "Выжимаем максимум из React.js",
        "speakerIDs": [
          52
        ],
        "description": "Рассмотрим, как оптимизировать SPA, написанный с использованием React.js",
        "time": "14:00 (4го июня)"
      },
      {
        "title": "How to FAIL Web Accessibility",
        "speakerIDs": [
          43
        ],
        "description": "Ошибки, заблуждения, мелочи, и просто глупые аспекты современной веб-доступности",
        "time": "Второй поток"
      },
      {
        "title": "Living the GNU/Linux Dream",
        "speakerIDs": [
          67
        ],
        "description": "Уже много лет я увлекаюсь Линуксом и FOSS. Сейчас в составе команды Яндекс.Карт я разрабатываю приложения, которыми пользуются миллионы пользователей ежедневно. В докладе я расскажу о том, как разработчики Яндекс.Карт используют Node.js в сочетании с утилитами GNU/Linux для разработки, деплоя, поддержки и мониторинга серверных приложений, работающих под большой нагрузкой.",
        "time": "14:35"
      },
      {
        "title": "Безусловное программирование",
        "speakerIDs": [
          49
        ],
        "description": "Можно ли писать программу без ветвлений? Так ли обязательны условия для алгоритмов fizz-buzz и крестики-нолики? Попробуем научиться мыслить \"прямолинейно\".",
        "time": "Второй поток"
      },
      {
        "title": "Гонки дронов: спорт для гиков.",
        "speakerIDs": [
          4
        ],
        "description": "Очень кратко о гонках дронов - свежем виде спорта и хобби. Живой гоночный дрон и другое оборудование (демо без полетов). Завлекательные видео, ответы на вопросы - в избытке.",
        "time": "15:10",
        "break": {
          "time": "15:30"
        }
      },
      {
        "title": "Внедрение новых технологий в 10 летнем проекте",
        "speakerIDs": [
          31
        ],
        "description": "",
        "time": "15:10"
      },
      {
        "title": "Будь первым",
        "speakerIDs": [
          31
        ],
        "description": "",
        "time": "15:10"
      },
      {
        "title": "TV in browsers: live cases",
        "speakerIDs": [
          1
        ],
        "description": "До сих пор многие медиа-компании используют для стриминга видео контента Flash или Silverlight. Посмотрим, как начать жить проще и по HTML5-стандартам.",
        "time": "16:00"
      },
      {
        "title": "API Панорам",
        "speakerIDs": [
          68
        ],
        "description": "В докладе пойдет речь про недавнее большое обновление API Яндекс.Карт. А именно об API Панорам. При помощи этого API теперь есть возможность встроить себе на сайт Панорамы улиц Яндекса. Аналогично при помощи API Панорам можно отображать собственные панорамы.",
        "time": "Второй поток"
      },
      {
        "title": "Welcome to V/A/M R.",
        "speakerIDs": [
          57
        ],
        "description": "Что же кроется за этими тремя буквами VAM? Как мы к такому пришли? Что на самом деле сейчас происходит в мире VR? Зачем вообще идти в VR, если здесь тепло и есть печеньки?",
        "time": "16:40"
      },
      {
        "title": "Code review",
        "time": "Второй поток",
        "speakerIDs": [
          13
        ],
        "description": "Часто встречающиеся ошибки на основе анализа реального production-кода.",
        "break": {
          "time": "17:20"
        }
      },
      {
        "title": "Blend4Web: нативные врата в мир WebGL",
        "speakerIDs": [
          18
        ],
        "description": "Краткий обзор возможностей фреймворка blend4web по мотивам первой конференции blend4web в Москве. Стек WebGL сейчас, конкуренты и что дает нам opensource. А также другие модные слова: WebVR, Gamepad API, WebGL 2.0.",
        "time": "17:50"
      },
      {
        "title": "CSS Quickdraw 2.0",
        "description": "Кто был на #RSConf уже успел познакомиться c CSS Quickdraw. Но далеко не все взяли ноутбуки и были лишь в качестве зрителей. Исправляемся, берем на митап и играем!. Вас ждут: - новые задания; - пофиксанный бекенд; - лицензии от JetBrains в качестве приза первой тройке; - почетное звание фронтендщик \"руки-ножницы\" победителю. Let's Roll!",
        "time": "18:20",
        "imagePath": "images/cssqd.png",
        "speakerIDs": [
          46
        ],
        "party": {
          "time": "19:00",
          "title": "Beer.js party",
          "description": "Place: TBD"
        }
      }
    ]
  },
  {
    "id": "rs#24",
    "name": "The Rolling Scopes #24",
    "date": "21 апреля, 2016",
    "location": "imaguru.co",
    "locationLink": "http://imaguru.co/ru",
    "schedule": [
      {
        "title": "Ленивая история про ленивый JavaScript",
        "imagePath": "images/speakers/denis_vlassenko.jpg",
        "time": "19:00",
        "speakerIDs": [
          54
        ],
        "description": "Бытует мнение, что программисты очень ленивы. Не каждый ли из них всю жизнь ищет свой философский камень – супер-платформу для супербыстрой разработки супер-приложений, имея которую стало бы возможно писать меньше, но создавать больше? И не найдя, разрабатывает свою. Потом наступает особый день, и великая мудрость озаряет их разум, и ленивые программисты начинают создавать ленивые алгоритмы; они потребляют меньше ресурсов и реже нуждаются в оптимизации. И прогресс продолжается. Хотя стандартная модель вычислений в JavaScript отнюдь не ленива, незначительная трансформация мышления, парочка правильных библиотек и крупица хитрости достаточны для того, чтобы  несколько разгрузить центральный процессор."
      },
      {
        "title": "Как мы разрабатываем Orange Buildboard 2.0",
        "imagePath": "images/speakers/konstantin_krivlenia.jpg",
        "speakerIDs": [
          31
        ],
        "description": "Атоматизация процесса разработки задач. С  микросервисами на Meteor и Koa.",
        "time": "20:00",
        "break": {
          "time": "20:45"
        }
      },
      {
        "title": "Redux в реальной жизни",
        "imagePath": "images/speakers/ivan_akulov.jpg",
        "speakerIDs": [
          60
        ],
        "description": "Ваня расскажет про самые популярные подходы и инструменты, применяемые в Redux-проектах. Доклад будет наиболее полезен тем, кто знаком с Redux-ом, но ещё не сталкивался с ним вплотную.",
        "time": "21:05"
      }
    ]
  },
  {
    "id": "rs#23",
    "name": "RS on Tour. Gomel",
    "date": "9 апреля, 2016",
    "location": "г. Гомель, ул.Ланге, д.17",
    "locationLink": "https://goo.gl/maps/S3w8FZD4kJE2",
    "schedule": [
      {
        "title": "NightwatchJS. Легенды ночных стражей",
        "imagePath": "images/speakers/vasiliy_vanchuk.jpg",
        "time": "15:00",
        "speakerIDs": [
          48
        ],
        "description": "Как сова помогала ловить баги. Укрощение Selenium в асинхронном стиле."
      },
      {
        "title": "Asyncable ES для тех, кто еще не в теме",
        "imagePath": "images/speakers/denis_vlassenko.jpg",
        "speakerIDs": [
          54
        ],
        "description": "Говорят, shift happens. Иногда внезапно. Но сейчас не тот случай. Будучи уверенным, что все мы уже активно транспилим наши гиперсовременные скрипты с babeljs, создаем бесконечные последовательности функциями-генераторами, эффектно проксируем объекты и наслаждаемся 92х процентной поддержкой ES2015 в Chrome Canary... Да, будучи уверенным во все этом, предлагаю обсудить асинхронное будущее ECMAScript: приторно сладкие async/await.",
        "time": "16:20"
      },
      {
        "title": "Welcome to V/A/M R.",
        "imagePath": "images/speakers/paul_yuhnovich.jpg",
        "speakerIDs": [
          57
        ],
        "description": "Что же кроется за этими тремя буквами VAM? Как мы к такому пришли? Что на самом деле сейчас происходит в мире VR? Зачем вообще идти в VR, если здесь тепло и есть печеньки?",
        "time": "17:05",
        "break": {
          "time": "17:35"
        }
      },
      {
        "title": "Google Closure Library + Compiler - Что в этом особенного и как это работает",
        "description": "Речь пойдет об инструментах, с помощью которых построены многие продукты Google, содержащие большое количество строк JS кода; какие проблемы решает Google Closure library и Google Closure Compiler.",
        "time": "17:55",
        "speakerIDs": [
          59
        ]
      },
      {
        "title": "TV in browsers: live cases",
        "imagePath": "images/speakers/alex_karlovich.jpg",
        "speakerIDs": [
          1
        ],
        "description": "До сих пор многие медиа-компании используют для стриминга видео контента Flash или Silverlight. Посмотрим, как начать жить проще и по HTML5-стандартам.",
        "time": "18:40",
        "break": {
          "time": "19:10"
        }
      },
      {
        "title": "Web Accessibility",
        "description": "В ходе доклада рассмотрим: <ul><li>Что такое Accessibility</li><li>WCAG 2.0</li><li>Accessibility Checklists</li><li>Keyboard-only Access</li><li>Accessible Forms</li><li>Accessible Visuel information</li><li>Screen Readers</li><li>WAI-ARIA</li><li>High Contrast Mode</li></ul>",
        "time": "19:30",
        "speakerIDs": [
          43
        ],
        "party": {
          "time": "21:00",
          "title": "Beer.js party",
          "description": "<a target='_blank' href='http://avenue.relax.by/'>Кафе-бар Avenue</a>, пр-т Ленина, 3 "
        }
      }
    ]
  },
  {
    "id": "rs#22",
    "name": "The Rolling Scopes #22. Brest",
    "date": "12 марта, 2016",
    "location": "г. Брест, ул.Гоголя,13",
    "locationLink": "https://www.google.by/maps/place/Gogolia+St+13,+Brest/@52.090187,23.6789445,16.06z/data=!4m2!3m1!1s0x47210bec15bc9109:0x5e28b6234bb723b0?hl=en",
    "schedule": [
      {
        "title": "Под капотом у Reactjs",
        "imagePath": "images/speakers/vitali_fokin.jpg",
        "speakerIDs": [
          52
        ],
        "description": "В современном мире Frontend разработки Reactjs набирает все большую популярность и оказывает огромное влияние на развитие индустрии в целом. Предлагаю разобраться откуда растут ноги у этого явления и почему все говорят, что React очень быстрый. В процессе мы познакомимся с принципами работы Reactjs и узнаем как все работает внутри.",
        "time": "14:00"
      },
      {
        "title": "Synthetic events в Reactjs",
        "imagePath": "images/speakers/vladimir_demin.jpg",
        "speakerIDs": [
          55
        ],
        "description": "Reactjs интригует своей скоростью и простотой. Как все простые на первый взгляд вещи, внутри они скрывают важные мелочи, в данном случае касаемые производительности. В небольшом блиц-докладе предлагаю разобраться с тем, как работают Syntethic events в Reactjs и как устроить их симбиоз с DOM Events.",
        "time": "14:45",
        "break": {
          "time": "15:05"
        }
      },
      {
        "title": "Социальный проект Brest Fortress Hidden History",
        "imagePath": "images/speakers/dmitriy_rybalko.jpg",
        "speakerIDs": [
          53
        ],
        "description": "Что может получиться, когда интересный проект разрабатывает команда с не менее \"интересными\" навыками. Приходи и узнай всю скрытую историю о том как мобильное приложение на cordova\\ionic\\crosswalk разрабатывалось в студенческой лаборатории.",
        "time": "15:25"
      },
      {
        "title": "Progressive Web Apps",
        "imagePath": "images/speakers/alexander_orgish.jpg",
        "speakerIDs": [
          49
        ],
        "description": "Что стоит за новым баззвордом Prоgressive Web App? Действительно ли это новый шаг в эволюции веб и мобильных приложений? Как сейчас создают прогрессивные, привлекательные и высоко-производительные онлайн\\оффлайн веб-приложения. ",
        "time": "16:10",
        "break": {
          "time": "16:55"
        }
      },
      {
        "title": "Asyncable ES для тех, кто еще не в теме",
        "imagePath": "images/speakers/denis_vlassenko.jpg",
        "speakerIDs": [
          54
        ],
        "description": "Говорят, shift happens. Иногда внезапно. Но сейчас не тот случай. Будучи уверенным, что все мы уже активно транспилим наши гиперсовременные скрипты с babeljs, создаем бесконечные последовательности функциями-генераторами, эффектно проксируем объекты и наслаждаемся 92х процентной поддержкой ES2015 в Chrome Canary... Да, будучи уверенным во все этом, предлагаю обсудить асинхронное будущее ECMAScript: приторно сладкие async/await.",
        "time": "17:15"
      },
      {
        "title": "TV in browsers: live cases",
        "imagePath": "images/speakers/alex_karlovich.jpg",
        "speakerIDs": [
          1
        ],
        "description": "До сих пор многие медиа-компании используют для стриминга видео контента Flash или Silverlight. Посмотрим, как начать жить проще и по HTML5-стандартам.",
        "time": "18:00"
      },
      {
        "title": "Intro to usability heuristics",
        "imagePath": "images/speakers/kseniya_koltun.jpg",
        "speakerIDs": [
          56
        ],
        "description": "Дизайн тренды меняются из года в год, мы стараемся следить и применять новомодные новшества в своих проектах. За всем этим мы забываем, что поведение человека не меняется веками: ни как он принимает решения, ни как действует. <s>Это эволюция, детка!</s> Я хочу рассказать об этих поведенческих столпах, которые включены в usability гайдланы, и лучше бы нам их придерживаться.",
        "time": "18:30",
        "party": {
          "time": "20:00",
          "title": "Beer.js party",
          "description": "<a target='_blank' href='https://www.facebook.com/lakavekave/'>Кафе La Kave</a>, ул. Советская, 50"
        }
      }
    ]
  },
  {
    "id": "rs#21",
    "name": "The Rolling Scopes #21",
    "date": "15 декабря, 2015",
    "location": "imaguru.co",
    "locationLink": "http://imaguru.co/ru",
    "schedule": [
      {
        "title": "Полгода жизни с хомяком",
        "imagePath": "images/speakers/vasiliy_vanchuk.jpg",
        "time": "19:00",
        "break": {
          "time": "20:00"
        },
        "speakerIDs": [
          48
        ],
        "description": "История вливания в проект на Ember.js. Какие ощущение появляются когда впервые знакомишься с \"янтарным\" фреймворком и как эти ощущения меняются с течением времени. Если бы я знал как это будет ..."
      },
      {
        "title": "Какой к черту Angular2, с цензурой и без хомяков",
        "imagePath": "images/aurelia-logo.png",
        "time": "20:20",
        "speakerIDs": [
          50,
          51
        ],
        "description": "Пара безбашеных ребята в веселой манере расскажут и покажут фрэймворк завтрашнего дня Aurelia.io. Как это заведено в наши дни, кинут камень в огород Angular... Приходите, зарядитесь энергией и узнайте много нового!"
      }
    ]
  },
  {
    "id": "rs#20",
    "name": "RS on Tour. Brest",
    "date": "21 ноября, 2015",
    "location": "г. Брест, ул.Гоголя,13",
    "locationLink": "https://www.google.by/maps/place/Gogolia+St+13,+Brest/@52.090187,23.6789445,16.06z/data=!4m2!3m1!1s0x47210bec15bc9109:0x5e28b6234bb723b0?hl=en",
    "schedule": [
      {
        "title": "Доклад-обсуждение: Тренды front-end разработки 2015: Процессы, Фреймворки, Библиотеки, Инструменты.",
        "imagePath": "images/speakers/dzmitry_varabei.jpg",
        "speakerIDs": [
          19
        ],
        "description": "",
        "time": "16:00",
        "materials": [
          {
            "slidesLink": "http://rolling-scopes.github.io/slides/rs20/trends/"
          }
        ]
      },
      {
        "title": "Полгода жизни с хомяком",
        "imagePath": "images/speakers/vasiliy_vanchuk.jpg",
        "speakerIDs": [
          48
        ],
        "description": "История вливания в проект на Ember.js.  Какие ощущение появляются когда впервые знакомишься с \"янтарным\" фреймворком и как эти ощущения меняются с течением времени. Если бы я знал как это будет ...",
        "time": "16:45",
        "materials": [
          {
            "slidesLink": "http://rolling-scopes.github.io/slides/rs20/ember-presentation.pptx"
          }
        ]
      },
      {
        "title": "WCAG 2.0 или боль доступного веба",
        "imagePath": "images/speakers/stanislau_zubovich.jpg",
        "speakerIDs": [
          43
        ],
        "description": "<ul><li>Introduction to accessibility</li><li>Techniques you can implement today</li><li>Introduction to screen readers and ARIA</li><li>Testing tips and tricks&amp;tricks</li></ul>",
        "time": "17:30",
        "materials": [
          {
            "slidesLink": "http://stanislauzubovich.github.io/WCAG/"
          }
        ]
      },
      {
        "title": "Глобальные оптимизации Глобальной карты или как подружить leaflet, lodash и marionette",
        "imagePath": "images/speakers/denis_sheko.jpg",
        "speakerIDs": [
          18
        ],
        "description": "Доклад о том, как оптимизировалась отрисовка Глобальной карты (пошаговая стратегия в браузере), какие проблемы пришлось решать, решения применять и какие выводы можно сделать.",
        "time": "18:20",
        "materials": [
          {
            "slidesLink": "http://rolling-scopes.github.io/slides/rs20/global-map-performance.pptx"
          }
        ]
      },
      {
        "title": "How it works: WebSockets",
        "imagePath": "images/speakers/alexander_orgish.jpg",
        "speakerIDs": [
          49
        ],
        "description": "Как работают веб-сокеты, взгляд изнутри: протокол, сообщения, возможность расширения",
        "time": "19:00",
        "materials": [
          {
            "slidesLink": "http://rolling-scopes.github.io/slides/rs20/web-sockets-internals-slides/#/"
          }
        ]
      },
      {
        "title": "Программирование железа на JS - Tessel.io, NodeCopter",
        "imagePath": "images/speakers/dzmitry_gerasimov.jpg",
        "speakerIDs": [
          20
        ],
        "description": "",
        "time": "19:50",
        "materials": [
          {
            "slidesLink": "http://rootthelure.github.io/tessel-talk/slides/"
          }
        ]
      }
    ]
  },
  {
    "id": "rs#19",
    "name": "The Rolling Scopes #19",
    "date": "5 ноября, 2015",
    "location": "imaguru.co",
    "locationLink": "http://imaguru.co/ru",
    "schedule": [
      {
        "title": "Improve performance of <strike>your app</strike> developer",
        "description": "Обзор полезных тулов, плагинов которые позволят Вам увеличить скорость разработки и уделять больше времени попиванию кофе и поеданию печенек",
        "imagePath": "images/fast-typing.gif",
        "time": "19:00",
        "break": {
          "time": "20:00"
        },
        "speakerIDs": [
          46
        ],
        "materials": [
          {
            "title": "Improve performance of <strike>your app</strike> developer",
            "slidesLink": "http://rolling-scopes.github.io/slides/rs19/dev-perf",
            "videoLink": "https://www.youtube.com/watch?v=wPtPazwndKg",
            "speakerIDs": [
              46
            ]
          }
        ]
      },
      {
        "title": "Нам больше не нужны тестеры или protractor.js",
        "description": "Расскажем про то, как команда разработчиков пыталась (и пытается) писать end to end тесты паралельно с разработкой нескольких single page hybrid-applications. Будет интересно тем, кто хочет автоматизировать Cпойлер: Доклад не связан с Angular",
        "imagePath": "images/protractor-qa-logo.png",
        "time": "20:20",
        "speakerIDs": [
          7,
          47
        ],
        "materials": [
          {
            "slidesLink": "http://rolling-scopes.github.io/slides/rs19/automation.pptx"
          }
        ]
      }
    ]
  },
  {
    "id": "rs#18",
    "name": "The Rolling Scopes #18",
    "date": "20 августа, 2015",
    "location": "imaguru.co",
    "locationLink": "http://imaguru.co/ru",
    "schedule": [
      {
        "title": "Taucharts: что скрывают эти данные, сhart побери!",
        "description": "Визуализация стала горячей темой, как только мир вошёл в эру больших данных. Однако тихая революция случилась 19 августа 1999 года с выходом книги Леланда Вилкинсона “Grammar of graphics” (GoG), в которой автор представил универсальную концепцию визуализации данных. <a target=\"_blank\" href=\"http://taucharts.com/\">“Taucharts”</a> - графическая open source библиотека, основанная на принципах GoG и разработанная компанией Taucraft. Бегло освоив фундаментальные принципы визуализации, мы заставим данные “говорить”, используя “Taucharts”. Много графики и картинок, скучно не будет! В качестве бонуса вы услышите увлекательную историю о том, как библиотека набрала популярность за 3 дня и попала в <a target=\"_blank\" href=\"http://javascriptweekly.com/\">JavaScript Weekly</a> рассылку.",
        "imagePath": "images/speakers/vladimir_petriko.jpg",
        "time": "19:00",
        "speakerIDs": [
          16,
          31
        ]
      },
      {
        "title": "React Native in action",
        "description": "Как разрабатывать действительно нативные приложения, контролируемые JavaScript’ом, не используя WebView. Впечатления и обзор новинки от Facebook’a с кучей демок.",
        "time": "19:35",
        "break": {
          "time": "20:20"
        },
        "speakerIDs": [
          45
        ]
      },
      {
        "title": "Git, Commmit and Code Review",
        "description": "Обсудим git и его внутреннюю архитектуру, популярные подходы работы (Git Flow, GitHub Flow, GitLab Flow), полезные приёмы и хуки, процесс Code Review и его эффективной организации.",
        "time": "20:40",
        "speakerIDs": [
          19
        ]
      }
    ]
  },
  {
    "id": "rs#17",
    "name": "The Rolling Scopes #17",
    "date": "21 мая, 2015",
    "location": "imaguru.co",
    "locationLink": "http://imaguru.co/ru",
    "schedule": [
      {
        "title": "Железо, как хобби: от светодиода до \"умного\" дома",
        "description": "Рассказ о том, что занятные девайсы в наше время вполне можно делать самостоятельно, обладая даже небольшими познаниями в электронике и программировании.",
        "time": "19:00",
        "break": {
          "time": "20:00"
        },
        "speakerIDs": [
          4
        ],
        "materials": [
          {
            "title": "Железо, как хобби: от светодиода до \"умного\" дома",
            "videoLink": "https://www.youtube.com/watch?v=rcM1hNBzTD0",
            "speakerIDs": [
              4
            ]
          }
        ]
      },
      {
        "title": "Программирование Parrot AR Drone на JS",
        "description": "Парни покажут и расскажут о программировании квадрокоптера Parrot AR Drone.",
        "imagePath": "images/speakers/dzmitry_gerasimov.jpg",
        "time": "20:20",
        "speakerIDs": [
          20,
          28
        ],
        "materials": [
          {
            "title": "Leapmotion, Tessel demos",
            "videoLink": "https://www.youtube.com/watch?v=pdVF82loP6Q",
            "speakerIDs": [
              20
            ]
          },
          {
            "title": "Программирование Parrot AR Drone на JS",
            "videoLink": "https://www.youtube.com/watch?v=pdVF82loP6Q#t=33m29s",
            "speakerIDs": [
              28
            ]
          }
        ]
      }
    ]
  },
  {
    "id": "rs#16",
    "name": "The Rolling Scopes #16",
    "date": "7 апреля, 2015",
    "location": "imaguru.co",
    "locationLink": "http://imaguru.co/ru",
    "schedule": [
      {
        "title": "Flux для твоей бабушки",
        "description": "О Flux архитектуре и её вариациях",
        "time": "19:00",
        "speakerIDs": [
          41
        ]
      },
      {
        "title": "Как мы готовим React",
        "description": "Как мы в течении трех месяцев с нуля делали SPA на базе React, Flux, babel, webpack, и тд",
        "time": "19:30",
        "break": {
          "time": "20:00"
        },
        "speakerIDs": [
          2
        ],
        "materials": [
          {
            "slidesLink": "http://rolling-scopes.github.io/slides/rs16/cook-reack.pptx"
          }
        ]
      },
      {
        "title": "Immutable.js: борьба с изменяемым состоянием в JS",
        "description": "Изменяемое состояние объектов, проблемы и опасности. Неэффективное использование ресурсов встроенными структурами данных на операциях копирования, map, reduce, filter. Решение - использование Immutable.js от Facebook.",
        "time": "19:00",
        "speakerIDs": [
          12
        ]
      },
      {
        "title": "Isomorphic JavaScript",
        "description": "Isomorphic JavaScript",
        "time": "19:00",
        "speakerIDs": [
          9
        ]
      }
    ]
  },
  {
    "id": "rs#15",
    "name": "The Rolling Scopes #15",
    "date": "24 февраля, 2015",
    "location": "imaguru.co",
    "locationLink": "http://imaguru.co/ru",
    "schedule": [
      {
        "title": "Анимации в вебе",
        "description": "Тема анимаций c помощью CSS и JavaScript сейчас поднимается очень часто. Rolling Scopes тоже не смогли обойти её стороной. О потрясающих возможностях данной технологии, тонкостях работы и своих экспериментах с ней расскажет Кирилл Демура.",
        "time": "19:00",
        "break": {
          "time": "20:00"
        },
        "speakerIDs": [
          28
        ],
        "materials": [
          {
            "title": "Анимации в вебе",
            "slidesLink": "http://rolling-scopes.github.io/slides/rs15/animations-in-front-end",
            "videoLink": "https://www.youtube.com/watch?v=WM3BdSLOTVo",
            "speakerIDs": [
              28
            ]
          }
        ]
      },
      {
        "title": "CSS Quickdraw",
        "description": "Кто был на #RSConf уже успел познакомиться (а кто-то даже поучаствовал и выиграл хромбук) в CSS квизе. Но далеко не все взяли ноутбуки и были лишь в качестве зрителей. Исправляемся, берем на митап лэптопы и играем вместе с Сашей Герасимовым. Вас ждут: - новые задания; - пофиксанный бекенд; - лицензии от JetBrains в качестве приза первой тройке; - почетное звание фронтендщик \"руки-ножницы\" победителю. Let's Roll!",
        "time": "20:20",
        "speakerIDs": [
          0
        ]
      }
    ]
  },
  {
    "id": "rs#14",
    "name": "The Rolling Scopes #14",
    "date": "16 декабря, 2014",
    "location": "imaguru.co",
    "locationLink": "http://imaguru.co/ru",
    "schedule": [
      {
        "title": "Learn the rules of Agile estimates to break them properly",
        "description": "Разговоры об Аджайл уже успели не только войти в моду, но и выйти из нее. При этом у многих осталось чувство недосказанности, как же на самом деле все это работает in real life. Одна из насущных тем – аджайл эстимейты. Как успеть оценить все фичи за отведенное время? Как ответить на вопрос «когда все будет», если вы эстимируете в пингвинах? Что мы вообще эстимируем и какие работы обычно входят в оценку? Приходите, попробуем проэстимировать тестовый беклог и разобраться во всех этих вопросах.",
        "time": "19:00",
        "break": {
          "time": "20:10"
        },
        "speakerIDs": [
          10
        ],
        "materials": [
          {
            "title": "Learn the rules of Agile estimates to break them properly",
            "slidesLink": "http://rolling-scopes.github.io/slides/rs14/Agile-Estimations",
            "videoLink": "https://www.youtube.com/watch?v=gmwqP0uxxQA",
            "speakerIDs": [
              10
            ]
          }
        ]
      },
      {
        "title": "Enhance your browser: Chrome Extensions",
        "description": "Поговорим о том, как расширить функциональность браузера либо изменить его поведение или внешний вид с помощью дополнений, используя привычные web технологии, без необходимости погружения в native код. В данном докладе речь пойдет о разработке расширений Chrome Extensions для наиболее популярного браузера Google Chrome c хорошо развиваемым и гибким API.",
        "time": "20:30",
        "speakerIDs": [
          37
        ],
        "materials": [
          {
            "title": "Enhance your browser: Chrome Extensions",
            "slidesLink": "http://rolling-scopes.github.io/slides/rs14/ChromeExtensions",
            "videoLink": "https://www.youtube.com/watch?v=2HuKwwhpsgE",
            "speakerIDs": [
              37
            ]
          }
        ]
      }
    ],
    "usefulLinks": [
      {
        "text": "Дополнительно об особенностях работы V8 можно прочитать тут:",
        "link": {
          "text": "Optimization-killers",
          "url": "https://github.com/petkaantonov/bluebird/wiki/Optimization-killers"
        }
      }
    ]
  },
  {
    "id": "rs#13",
    "name": "The Rolling Scopes #13",
    "date": "27 ноября, 2014",
    "location": "imaguru.co",
    "locationLink": "http://imaguru.co/ru",
    "schedule": [
      {
        "title": "Увидеть Париж и угореть!",
        "imagePath": "images/dot_logo.jpg",
        "description": "Саша, Дима и Юра вернулись из столицы Франции и готовы сделать обзор самых интересных и полезных докладов двух крупнейших конференций из мира фронтенда - dotJS и dotCSS.",
        "time": "19:00",
        "break": {
          "time": "20:10"
        },
        "speakerIDs": [
          19,
          0,
          44
        ],
        "materials": [
          {
            "title": "Увидеть Париж и угореть! (Обзор dotJS)",
            "slidesLink": "http://rolling-scopes.github.io/slides/rs13/dotJS-overview",
            "videoLink": "https://www.youtube.com/watch?v=pvFz9ob-mik",
            "speakerIDs": [
              19
            ]
          },
          {
            "title": "Увидеть Париж и угореть! (Обзор dotCSS)",
            "slidesLink": "http://rolling-scopes.github.io/slides/rs13/dotJS-overview/yt/dotCSS.pptx",
            "speakerIDs": [
              44
            ]
          },
          {
            "title": "Перевод доклада от Angus Croll - The Book Nerd's Guide to JavaScript",
            "slidesLink": "https://speakerdeck.com/anguscroll/the-book-nerds-guide-to-javascript",
            "videoLink": "https://www.youtube.com/watch?v=pvFz9ob-mik&t=31m22s",
            "speakerIDs": [
              0
            ]
          }
        ]
      },
      {
        "title": "Test Driven Development: More Development Than Ever",
        "description": "TDD существует уже 15 лет, но до сих пор разработчики смотрят на эту технику как на новомодную игрушку, придуманную людьми, ничего не понимающими в программировании. Кирилл использует TDD в своей ежедневной практике не первый день и знаком с ней не понаслышке. В рамках своего доклада он расскажет, чем именно может быть полезна разработка через тестирование нам - программистам, и попытается показать, что именно мы как никто другой получаем от нее наибольшую выгоду.",
        "time": "20:30",
        "speakerIDs": [
          26
        ],
        "materials": [
          {
            "title": "Test Driven Development: More Development Than Ever",
            "slidesLink": "http://www.slideshare.net/kirbarn/test-driven-development-more-development-than-ever",
            "videoLink": "https://www.youtube.com/watch?v=pvFz9ob-mik&t=1h48m15s",
            "speakerIDs": [
              26
            ]
          }
        ]
      }
    ]
  },
  {
    "id": "rs#12",
    "name": "The Rolling Scopes #12",
    "date": "16 октября, 2014",
    "location": "imaguru.co",
    "locationLink": "http://imaguru.co/ru",
    "schedule": [
      {
        "title": "Why Y?",
        "time": "19:00",
        "speakerIDs": [
          15
        ],
        "materials": [
          {
            "title": "Why Y?",
            "slidesLink": "http://u-abramchuk.github.io/presentations/y-rolling-scopes-2014",
            "videoLink": "https://www.youtube.com/watch?v=hZiMuwrYBEw",
            "speakerIDs": [
              15
            ]
          }
        ]
      },
      {
        "title": "How to not program on AngularJS",
        "time": "19:45",
        "break": {
          "time": "20:20"
        },
        "speakerIDs": [
          6
        ],
        "materials": [
          {
            "title": "How to not program on AngularJS ",
            "slidesLink": "http://slides.com/andrewyemialyanchik/how-to-not-program-on-angularjs",
            "videoLink": "https://www.youtube.com/watch?v=IDvb3QI98Uc",
            "speakerIDs": [
              6
            ]
          }
        ]
      },
      {
        "title": "AngularJS and how you shouldn’t use it",
        "time": "20:40",
        "speakerIDs": [
          32
        ],
        "materials": [
          {
            "title": "AngularJS and how you shouldn’t use it? ",
            "slidesLink": "http://rolling-scopes.github.io/slides/rs12/Angular_Js.pptx",
            "videoLink": "https://www.youtube.com/watch?v=efM-0sxCUxs",
            "speakerIDs": [
              32
            ]
          }
        ]
      },
      {
        "title": "WebKit JavaScript Core optimizations layers",
        "time": "21:10",
        "speakerIDs": [
          29
        ],
        "materials": [
          {
            "title": "WebKit JavaScript Engine optimizations",
            "slidesLink": "http://rolling-scopes.github.io/slides/rs12/WebKit-JavaScript-Engine-optimizations.pptx",
            "videoLink": "https://www.youtube.com/watch?v=xALTXSE8GQA",
            "speakerIDs": [
              29
            ]
          }
        ]
      }
    ]
  },
  {
    "id": "rs#11",
    "name": "The Rolling Scopes #11",
    "date": "7 августа, 2014",
    "location": "imaguru.co",
    "locationLink": "http://imaguru.co/ru",
    "schedule": [
      {
        "title": "Memory Profiling",
        "time": "19:00",
        "speakerIDs": [
          11
        ]
      },
      {
        "title": "Интеграция ReactJS в проект на RequireJS",
        "time": "19:45",
        "break": {
          "time": "20:20"
        },
        "speakerIDs": [
          13
        ]
      },
      {
        "title": "CSS Warm-Up ",
        "time": "20:40",
        "speakerIDs": [
          0
        ]
      }
    ]
  },
  {
    "id": "rsw#3",
    "name": "RS Workshop #3",
    "date": "29 июля, 2014",
    "location": "imaguru.co",
    "locationLink": "http://imaguru.co/ru",
    "schedule": [
      {
        "title": "Обработка и визуализация данных с помощью библиотеки D3.js на примере создания интерактивной карты Беларуси.",
        "description": "Будут рассмотрены: базовый функционал D3.js, источники географических данных и особенности работы с ними, построение интерактивной карты с нуля. Желательно захватить с собой ноутбук.",
        "time": "19:00",
        "speakerIDs": [
          27
        ],
        "materials": [
          {
            "title": "Обработка и визуализация данных: демо",
            "slidesLink": "http://rolling-scopes.github.io/slides/rsw-3-d3/d3-demo.zip",
            "speakerIDs": [
              27
            ]
          }
        ]
      }
    ]
  },
  {
    "id": "rs#10",
    "name": "The Rolling Scopes #10",
    "date": "28 мая, 2014",
    "location": "IBB",
    "locationLink": "http://ibb.by/educational-center",
    "schedule": [
      {
        "title": "News Digest",
        "time": "19:00",
        "speakerIDs": [
          41
        ]
      },
      {
        "title": "DOM Sweet DOOM",
        "time": "19:35",
        "break": {
          "time": "20:20"
        },
        "speakerIDs": [
          31
        ]
      },
      {
        "title": "Назад в будущее или мобильная разработка сегодня",
        "time": "20:50",
        "speakerIDs": [
          18
        ]
      },
      {
        "title": "Paper.js",
        "time": "21:15",
        "speakerIDs": [
          36
        ]
      }
    ]
  },
  {
    "id": "rsqa#2",
    "name": "RS Q&A #2 с Олегом Засыпкиным",
    "date": "29 апреля, 2014",
    "location": "imaguru.co",
    "locationLink": "http://imaguru.co/ru",
    "schedule": [
      {
        "title": "How Mozilla Works",
        "time": "19:00",
        "description": "В гостях у #TheRollingScopes будет Олег Засыпкин (Aleh Zasypkin) - Front-end Engineer, Mozilla, с темой доклада \"How Mozilla Works\". Немного о докладчике: работает в Mozilla относительно недавно, но уже успел поработать с такими проектами как \"Firefox for Windows 8 Touch\" и \"SMS app for Fifefox OS\"; за плечами у Олега большой опыт работы в IT, и даже компании Google не удалось удержать его в силиконовой долине. На митапе будет немного промо-продукции от Mozilla и конечно же девайсы на Firefox OS. - Как стать контрибьютором Mozilla? - Почему прекратили разработку Firefox под Window8 touch, что будет с кодом и проектом дальше? - Как там Брендан Эйк? :) Эти и многие другие вопросы вы можете задать на митапе, через twitter #rollingscopes, здесь в фейсбук, и на подготовленной Олегом онлайн-форме. А лучше приходите и пообщайтесь офлайн. До встречи!",
        "speakerIDs": [
          38
        ]
      }
    ]
  },
  {
    "id": "rs#9",
    "name": "The Rolling Scopes #9",
    "date": "27 марта, 2014",
    "location": "imaguru.co",
    "locationLink": "http://imaguru.co/ru",
    "schedule": [
      {
        "title": "Экзотические и полезные web API",
        "time": "19:00",
        "speakerIDs": [
          21
        ]
      },
      {
        "title": "Лямбда-исчисление",
        "time": "19:40",
        "break": {
          "time": "20:20"
        },
        "speakerIDs": [
          15
        ]
      },
      {
        "title": "Google Glass",
        "imagePath": "images/speakers/egor_miasnikov.jpg",
        "time": "20:50",
        "speakerIDs": [
          25,
          34
        ]
      },
      {
        "title": "JavaScript Linters",
        "time": "21:30",
        "speakerIDs": [
          3
        ],
        "materials": [
          {
            "title": "JavaScript Linters",
            "slidesLink": "http://rolling-scopes.github.io/slides/rs9/JavaScript-Linters/slides.html",
            "speakerIDs": [
              3
            ]
          }
        ]
      }
    ]
  },
  {
    "id": "rs#8",
    "name": "The Rolling Scopes #8",
    "date": "27 февраля, 2014",
    "location": "IBB",
    "locationLink": "http://ibb.by/educational-center",
    "schedule": [
      {
        "title": "Slylish Stylus",
        "time": "19:00",
        "speakerIDs": [
          1
        ],
        "materials": [
          {
            "title": "Stylish Stylus",
            "slidesLink": "http://rolling-scopes.github.io/slides/rs8/stylish-stylus/slides",
            "speakerIDs": [
              1
            ]
          }
        ]
      },
      {
        "title": "Keep Calm & Attend Events: LondonJs",
        "time": "19:40",
        "break": {
          "time": "20:20"
        },
        "speakerIDs": [
          0
        ],
        "materials": [
          {
            "title": "Keep Calm & Attend Events: LondonJs",
            "slidesLink": "http://rolling-scopes.github.io/slides/rs8/londonjs-talk",
            "speakerIDs": [
              0
            ]
          }
        ]
      },
      {
        "title": "Some fresh ideas from better-dom",
        "time": "20:40",
        "speakerIDs": [
          33
        ]
      }
    ]
  },
  {
    "id": "rs#7",
    "name": "The Rolling Scopes #7",
    "date": "12 декабря, 2013",
    "location": "МЕ100 (Независимости, 58)",
    "locationLink": "facebook.com/groups/me100",
    "schedule": [
      {
        "title": "Data processing with ql.io",
        "time": "19:00",
        "speakerIDs": [
          30
        ]
      },
      {
        "title": "JavaScript Virtual Machines",
        "time": "19:45",
        "break": {
          "time": "20:20"
        },
        "speakerIDs": [
          31
        ]
      },
      {
        "title": "WebKit Project Overview",
        "time": "20:40",
        "speakerIDs": [
          7
        ]
      },
      {
        "title": "RetroSpective",
        "imagePath": "images/speakers/alexander_gerasimov.jpg",
        "time": "21:20",
        "speakerIDs": [
          5,
          0,
          19,
          1
        ],
        "materials": [
          {
            "title": "RetroSpective",
            "slidesLink": "http://rolling-scopes.github.io/slides/rs7/RetroSpective",
            "speakerIDs": [
              5,
              0,
              19,
              1
            ]
          }
        ]
      }
    ]
  },
  {
    "id": "rsqa#1",
    "name": "RS Q&A #1 c Виталием Фридманом",
    "date": "29 ноября, 2013",
    "location": "imaguru.co",
    "locationLink": "http://imaguru.co/ru",
    "schedule": [
      {
        "title": "Responsive Web Design",
        "time": "19:00",
        "speakerIDs": [
          14
        ]
      }
    ]
  },
  {
    "id": "rs#6",
    "name": "The Rolling Scopes #6",
    "date": "30 октября, 2013",
    "location": "IBB",
    "locationLink": "http://ibb.by/educational-center",
    "schedule": [
      {
        "title": "NodeJS production on Windows Azure",
        "time": "19:00",
        "speakerIDs": [
          23
        ]
      },
      {
        "title": "История одного стартапа: Angular.js и как мы его готовим",
        "time": "19:40",
        "break": {
          "time": "20:20"
        },
        "speakerIDs": [
          40
        ]
      },
      {
        "title": "RnJvbnQtZW5kIFF1aXo=",
        "time": "20:40",
        "speakerIDs": [
          0
        ],
        "materials": [
          {
            "title": "RnJvbnQtZW5kIFF1aXo=",
            "slidesLink": "http://rolling-scopes.github.io/slides/rs6/quiz-2",
            "speakerIDs": [
              0
            ]
          }
        ]
      },
      {
        "title": "Hello, Data Binding",
        "time": "21:20",
        "speakerIDs": [
          42
        ]
      }
    ]
  },
  {
    "id": "rs#5",
    "name": "The Rolling Scopes #5",
    "date": "2 октября, 2013",
    "location": "IBB",
    "locationLink": "http://ibb.by/educational-center",
    "schedule": [
      {
        "title": "Seamless and partial page reload",
        "time": "19:00",
        "speakerIDs": [
          13
        ]
      },
      {
        "title": "Going To Interview: Best Practices",
        "time": "19:40",
        "break": {
          "time": "20:20"
        },
        "speakerIDs": [
          5
        ],
        "materials": [
          {
            "title": "Going To Interview: Best Practices",
            "slidesLink": "http://rolling-scopes.github.io/slides/rs5/interview-talk",
            "speakerIDs": [
              5
            ]
          }
        ]
      },
      {
        "title": "Taming AngularJS: A Directive's Lifecycle",
        "time": "20:40",
        "speakerIDs": [
          26
        ]
      },
      {
        "title": "Welcome to Node.js",
        "time": "21:20",
        "speakerIDs": [
          30
        ],
        "materials": [
          {
            "title": "Welcome to Node.js",
            "slidesLink": "http://rolling-scopes.github.io/slides/rs5/Welcome-to-node.js",
            "speakerIDs": [
              30
            ]
          }
        ]
      }
    ]
  },
  {
    "id": "rsw#2",
    "name": "RS Workshop #2",
    "date": "17 сентября, 2013",
    "location": "IBB",
    "locationLink": "http://ibb.by/educational-center",
    "schedule": [
      {
        "title": "WebSocket Challenge",
        "time": "19:00",
        "description": "Приглашаем всех пообщаться, принять участие в небольшом дружеском соревновании, ну и, конечно, пописать код на нашем воркшопе #2",
        "speakerIDs": [
          39
        ]
      }
    ]
  },
  {
    "id": "rs#4",
    "name": "The Rolling Scopes #4",
    "date": "29 августа, 2013",
    "location": "IBB",
    "locationLink": "http://ibb.by/educational-center",
    "schedule": [
      {
        "title": "Knock-knock Flexbox",
        "time": "19:00",
        "speakerIDs": [
          43
        ],
        "materials": [
          {
            "title": "Knock-knock Flexbox",
            "slidesLink": "http://rolling-scopes.github.io/slides/rs4/Flexbox",
            "speakerIDs": [
              43
            ]
          }
        ]
      },
      {
        "title": "Testing JavaScript Applications",
        "imagePath": "images/speakers/dzmitry_gerasimov.jpg",
        "time": "19:25",
        "break": {
          "time": "20:20"
        },
        "speakerIDs": [
          20,
          0
        ],
        "materials": [
          {
            "title": "Testing JavaScript Applications",
            "slidesLink": "http://rolling-scopes.github.io/slides/rs4/jstesting-talk",
            "speakerIDs": [
              20,
              0
            ]
          }
        ]
      },
      {
        "title": "JavaScript Must Die!",
        "time": "20:30",
        "speakerIDs": [
          31
        ],
        "materials": [
          {
            "title": "JavaScript Must Die!",
            "slidesLink": "http://rolling-scopes.github.io/slides/rs4/javascript_must_die",
            "speakerIDs": [
              31
            ]
          }
        ]
      },
      {
        "title": "JavaScript: Non-classical inheritance",
        "time": "21:00",
        "speakerIDs": [
          22
        ]
      },
      {
        "title": "Popups - breaking the habits",
        "time": "21:30",
        "speakerIDs": [
          42
        ],
        "materials": [
          {
            "title": "Popups - breaking the habits",
            "slidesLink": "http://rolling-scopes.github.io/slides/rs4/Popups-breaking-the-habits",
            "speakerIDs": [
              42
            ]
          }
        ]
      }
    ]
  },
  {
    "id": "rsw#1",
    "name": "RS Workshop #1",
    "date": "20 августа, 2013",
    "location": "IBB",
    "locationLink": "http://ibb.by/educational-center",
    "schedule": [
      {
        "title": "Тестирование JavaScript приложений",
        "imagePath": "images/speakers/dzmitry_gerasimov.jpg",
        "time": "19:00",
        "description": "Основные теги: BDD, funtional testing, Mocha, Chai, Jasmine, Casperjs",
        "speakerIDs": [
          0,
          20
        ]
      }
    ]
  },
  {
    "id": "rs#3",
    "name": "The Rolling Scopes #3",
    "date": "25 июля, 2013",
    "location": "МЕ100 (Независимости, 58)",
    "locationLink": "facebook.com/groups/me100",
    "schedule": [
      {
        "title": "Chrome remote debugging protocol",
        "time": "18:45",
        "speakerIDs": [
          16
        ],
        "materials": [
          {
            "title": "Chrome remote debugging protocol",
            "slidesLink": "http://rolling-scopes.github.io/slides/rs3/chrome-rdp-api/chrome-remote-debugging-protocol.html",
            "speakerIDs": [
              16
            ]
          }
        ]
      },
      {
        "title": "SpainJS",
        "imagePath": "images/speakers/andre_gloukhmantchouk.jpg",
        "time": "19:15",
        "break": {
          "time": "19:50"
        },
        "speakerIDs": [
          5,
          0,
          19,
          1
        ]
      },
      {
        "title": "Browser internals ",
        "time": "20:00",
        "speakerIDs": [
          19
        ]
      },
      {
        "title": "Asm.js ",
        "time": "20:00",
        "speakerIDs": [
          7
        ]
      },
      {
        "title": "Graceful Degradation and Progressive Enhancement",
        "time": "21:15",
        "speakerIDs": [
          42
        ]
      }
    ]
  },
  {
    "id": "rs#2",
    "name": "The Rolling Scopes #2",
    "date": "27 июня, 2013",
    "location": "МЕ100 (Независимости, 58)",
    "locationLink": "facebook.com/groups/me100",
    "schedule": [
      {
        "title": "JavaScript framework для highload-сайтов и трудности при его проектировании",
        "time": "18:00",
        "speakerIDs": [
          35
        ],
        "materials": [
          {
            "title": "JavaScript framework для highload-сайтов и трудности при его проектировании",
            "slidesLink": "http://rolling-scopes.github.io/slides/rs2/Developing-of-a-high-load-JavaScript-framework.pptx",
            "speakerIDs": [
              35
            ]
          }
        ]
      },
      {
        "title": "WebComponents in action",
        "time": "18:25",
        "speakerIDs": [
          3
        ]
      },
      {
        "title": "Front-end project assets management",
        "imagePath": "images/speakers/alexander_gerasimov.jpg",
        "time": "18:50",
        "break": {
          "time": "19:40"
        },
        "speakerIDs": [
          0,
          5
        ],
        "materials": [
          {
            "title": "Front-end project assets management",
            "slidesLink": "http://rolling-scopes.github.io/slides/rs2/front-end-project-assets-management",
            "speakerIDs": [
              0,
              5
            ]
          }
        ]
      },
      {
        "title": "<Video>Хроника",
        "time": "20:00",
        "speakerIDs": [
          1
        ],
        "materials": [
          {
            "title": "<Video>Хроника",
            "slidesLink": "http://rolling-scopes.github.io/slides/rs2/videoХроника.pptx",
            "speakerIDs": [
              1
            ]
          }
        ]
      },
      {
        "title": "HTML-coder never dies",
        "time": "20:20",
        "speakerIDs": [
          42
        ]
      },
      {
        "title": "Quiz",
        "time": "21:00",
        "speakerIDs": [
          0
        ],
        "materials": [
          {
            "title": "Quiz",
            "slidesLink": "http://rolling-scopes.github.io/slides/rs2/quiz",
            "speakerIDs": [
              0
            ]
          }
        ]
      }
    ]
  },
  {
    "id": "rs#1",
    "name": "The Rolling Scopes #1",
    "date": "21 мая, 2013",
    "location": "Независимости, 58 (EPAM Office)",
    "locationLink": "https://www.google.com/maps/place/%D0%BF%D1%80%D0%BE%D1%81%D0%BF.+%D0%9D%D0….5916226,17z/data=!3m1!4b1!4m2!3m1!1s0x46dbcfa64f90adad:0x872f5081b03fa96d",
    "schedule": [
      {
        "title": "Web Components",
        "time": "18:30",
        "speakerIDs": [
          3
        ]
      },
      {
        "title": "Introduction to Angular.js",
        "time": "18:55",
        "speakerIDs": [
          17
        ],
        "materials": [
          {
            "title": "Introduction to Angular.js",
            "slidesLink": "http://rolling-scopes.github.io/slides/rs1/angular",
            "speakerIDs": [
              17
            ]
          }
        ]
      },
      {
        "title": "Chrome DevTools",
        "time": "19:25",
        "speakerIDs": [
          19
        ],
        "materials": [
          {
            "title": "Chrome DevTools",
            "slidesLink": "http://rolling-scopes.github.io/slides/rs1/chromeDevTools/chromeDevTools.html",
            "speakerIDs": [
              19
            ]
          }
        ]
      },
      {
        "title": "Introduction to Ember",
        "time": "19:55",
        "speakerIDs": [
          8
        ]
      },
      {
        "title": "Fast Websites",
        "time": "20:20",
        "speakerIDs": [
          24
        ],
        "materials": [
          {
            "title": "Fast Websites",
            "slidesLink": "http://rolling-scopes.github.io/slides/rs1/fast-websites",
            "speakerIDs": [
              24
            ]
          }
        ]
      }
    ]
  }
]
